{
	"reliableLogistics": "Logística em que você pode confiar",
	"familyBusiness": "Empresa familiar estabelecida no Reino Unido, especializada no transporte de encomendas, mercadorias e mudanças para França, Espanha, Portugal, Ilhas Baleares e Ilhas Canárias.",
	"whatDoYouNeed": "O que você precisa?",
	"safeReliableServices": "Fornecemos serviços seguros e confiáveis",
	"courierServices": "Serviços de courier",
	"efficientNationalCourier": "Serviços nacionais de courier eficientes",
	"reliableTimelyDelivery": "Entrega confiável e pontual",
	"hassleFreeNationalShipping": "Envio nacional sem complicações",
	"customsCostsHandled": "Custos aduaneiros tratados para você",
	"importsExports": "Importações / Exportações",
	"gotoVanServices": "A GotoVan oferece serviços de importação e exportação confiáveis e eficientes, adaptados para atender às suas necessidades específicas. Esteja você trazendo mercadorias para o Reino Unido ou levando-as para a Espanha, nossa equipe experiente está aqui para cuidar da logística e proporcionar uma experiência de transporte sem problemas.",
	"movingWithinUK": "Mudando-se dentro do Reino Unido? Esteja você se mudando dentro da mesma cidade ou de uma cidade para outra, nossa equipe dedicada está aqui para ajudá-lo a cada passo do caminho.",
	"movingOutsideUK": "Mudando-se para fora do Reino Unido? A GotoVan oferece serviços de remoção nacionais convenientes e confiáveis para tornar sua mudança livre de estresse. Esteja você se mudando para Espanha, Portugal, França, Ilhas Baleares ou Ilhas Canárias, nossa equipe dedicada está aqui para ajudar em cada passo do caminho.",
	"clientsSpeak": "Nossos clientes falam",
	"whyUs": "Por que nós?",
	"anyQuestionsContactUs": "Alguma pergunta? Entre em contato",
	"trustworthy": "De confiança!",
	"smoothMovingExperience": "Sem dores de cabeça, sem custos ocultos, sem complicações na alfândega. Eles tornaram minha mudança muito simples, tanto para mim quanto para minha família. Vou repetir! - Carlos Dianez",
	"thankYouGotoVan": "Obrigado, GotoVan.",
	"excellentCompany": "Excelente empresa. Minha família e eu estamos usando seus serviços há quase um ano, que são excelentes com atenção pessoal e profissional. Os pacotes e seu conteúdo sempre chegam em excelentes condições. - Susana Mel",
	"simpleProcedures": "Procedimentos simples.",
	"stressFreeExperience": "Sem todo o estresse e surpresas com alfândega que outras empresas geram. Chegou até antes do esperado. Empresa extremamente recomendável. - Juan Antonio Portela",
	"highlyRecommended": "Altamente recomendável 100%",
	"customerReview": "Rápido, amigável, eficiente e sem complicações. 100% recomendado. Se eu precisar de outro envio, não hesitarei em contactá-los. - María Teresa Lara",
	"fillContactForm": "Preencha o formulário para entrar em contato conosco",
	"contactHours": "Horário de contato",
	"redirectToBlog": "Redirecionando para o nosso blog",
	"confirmExitWebsite": "Você está prestes a sair deste site, por favor, confirme",
	"thankYouForPurchase": "Obrigado pela sua compra!",
	"paymentSuccessful": "O pagamento foi bem-sucedido",
	"continueExploring": "Continue explorando",
	"pageNotFoundMessage": "Desculpe, não conseguimos encontrar a página que você estava procurando.",
	"confirm": "confirmar",
	"about": {
		"everythingBeginsWithJourney": "Tudo começa com uma jornada",
		"welcomeToGotoVan": "Bem-vindo à GotoVan, sua empresa líder em serviços de entregas com uma rica história de quatro anos na indústria de transporte. Temos orgulho em entregar pacotes com segurança e eficiência, além de fornecer serviços de remoção confiáveis em todo o Reino Unido, Espanha, Portugal, França, Ilhas Baleares e Ilhas Canárias.",
		"experiencedDriverTeam": "Nossa equipe experiente e profissional de motoristas está dedicada a garantir que seus pacotes e pertences cheguem ao destino no prazo e em perfeitas condições. Seja um pacote pequeno ou um serviço completo de remoção, a GotoVan é a sua escolha.",
		"priorityOfEfficiency": "Entendemos a importância do tempo, por isso priorizamos um serviço rápido e eficiente. Utilizando a tecnologia mais recente para rastreamento e monitoramento, mantemos você informado e confiante de que seu pacote está em boas mãos.",
		"commitmentToCustomerService": "Nosso compromisso com um atendimento ao cliente excepcional e nosso amplo conhecimento na indústria de transporte tornaram a GotoVan a escolha preferida tanto para indivíduos quanto para empresas. Junte-se a nós para experimentar a diferença que um serviço de qualidade pode fazer.",
		"dedicatedTeamTransport": "Todas as semanas, nossa equipe dedicada trabalha incansavelmente para transportar pacotes e mudanças entre o Reino Unido, França e Espanha. Desde coletas em todo o Reino Unido às quintas e sextas-feiras até uma jornada cuidadosamente planejada pela França para chegar à Espanha na segunda-feira, garantimos uma experiência tranquila e sem complicações.",
		"dedicatedToDeliveringItems": "Não importa o tamanho do seu envio, a GotoVan está dedicada a entregar itens com segurança e pontualidade, conectando empresas e indivíduos de forma transparente através das fronteiras. Confie em nós para obter serviços de entregas confiáveis e eficientes, onde quer que seu pacote precise ir."
	},
	"features": {
		"qualityService": "Serviço de qualidade",
		"familyOwnedBusiness": "Negócio familiar",
		"flexibility": "Flexibilidade",
		"liveTracking": "Rastreamento ao vivo",
		"serviceDescription": "Nós fornecemos um serviço <statsText>de alta qualidade</statsText> com coleta e entrega direto na sua porta.",
		"businessPride": "Temos orgulho em gerir este negócio como uma <statsText>família</statsText>, entregando nossos serviços com sucesso.",
		"humanTouch": "Somos humanos, e isso significa que <statsText>estamos aqui</statsText> para manter contato com você a cada passo do caminho.",
		"stayInformed": "<statsText>Fique informado</statsText> a cada passo do caminho.",
		"comingSoon": "EM BREVE"
	},
	"experienceYears": "Mais de <span>{{years}}</span> anos de experiência",
	"": ""
}