{
	"reliableLogistics": "Logistique sur laquelle vous pouvez compter",
	"familyBusiness": "Entreprise familiale établie au Royaume-Uni spécialisée dans le transport de colis, de marchandises et de déménagements vers la France, l'Espagne, le Portugal, les îles Baléares et les îles Canaries.",
	"whatDoYouNeed": "De quoi avez-vous besoin ?",
	"safeReliableServices": "Nous proposons des services sûrs et fiables",
	"courierServices": "Services de messagerie",
	"efficientNationalCourier": "Services de messagerie nationaux efficaces",
	"reliableTimelyDelivery": "Livraison fiable et ponctuelle",
	"hassleFreeNationalShipping": "Expédition nationale sans tracas",
	"customsCostsHandled": "Frais de douane gérés pour vous",
	"importsExports": "Importations / Exportations",
	"gotoVanServices": "GotoVan propose des services d'importation et d'exportation fiables et efficaces, adaptés à vos besoins spécifiques. Que vous acheminiez des marchandises vers le Royaume-Uni ou les transportiez vers l'Espagne, notre équipe expérimentée est là pour gérer la logistique et offrir une expérience de transport sans faille.",
	"movingWithinUK": "Vous déménagez au Royaume-Uni ? Que vous changiez de domicile dans la même ville ou que vous vous déplaciez d'une ville à l'autre, notre équipe dévouée est là pour vous assister à chaque étape du processus.",
	"movingOutsideUK": "Vous déménagez hors du Royaume-Uni ? GotoVan propose des services de déménagement nationaux pratiques et fiables pour rendre votre déménagement sans stress. Que vous déménagiez en Espagne, au Portugal, en France, aux îles Baléares ou aux îles Canaries, notre équipe dévouée est là pour vous aider à chaque étape du processus.",
	"clientsSpeak": "Nos clients témoignent",
	"whyUs": "Pourquoi nous ?",
	"anyQuestionsContactUs": "Des questions ? Contactez-nous",
	"trustworthy": "Digne de confiance !",
	"smoothMovingExperience": "Sans maux de tête, sans coûts cachés, sans tracas douaniers. Ils ont rendu mon déménagement très simple, aussi bien pour moi que pour ma famille. Je vais répéter ! - Carlos Dianez",
	"thankYouGotoVan": "Merci, GotoVan.",
	"excellentCompany": "Excellente entreprise. Ma famille et moi utilisons leurs services depuis presque un an maintenant, qui sont excellents avec une attention personnelle et professionnelle. Les colis et leur contenu arrivent toujours en excellent état. - Susana Mel",
	"simpleProcedures": "Procédures simples.",
	"stressFreeExperience": "Sans tout le stress et les surprises avec les douanes que génèrent d'autres entreprises. Il est même arrivé plus tôt que prévu. Entreprise extrêmement recommandable. - Juan Antonio Portela",
	"highlyRecommended": "Hautement recommandé à 100%",
	"customerReview": "Rapide, amical, efficace et sans tracas. Recommandé à 100%. Si j'ai besoin d'un autre envoi, je n'hésiterai pas à les contacter. - María Teresa Lara",
	"fillContactForm": "Remplissez le formulaire pour nous contacter",
	"contactHours": "Heures de contact",
	"redirectToBlog": "Redirection vers notre blog",
	"confirmExitWebsite": "Vous êtes sur le point de quitter ce site web, veuillez confirmer",
	"thankYouForPurchase": "Merci pour votre achat !",
	"paymentSuccessful": "Le paiement a été effectué avec succès",
	"continueExploring": "Continuez à explorer",
	"pageNotFoundMessage": "Désolé, nous n'avons pas pu trouver la page que vous recherchiez.",
	"confirm": "confirmer",
	"about": {
		"everythingBeginsWithJourney": "Tout commence par un voyage",
		"welcomeToGotoVan": "Bienvenue chez GotoVan, votre entreprise de services de coursier de premier plan avec une histoire riche de quatre ans dans l'industrie du transport. Nous sommes fiers de livrer en toute sécurité et efficacité des colis et de fournir des services de déménagement fiables dans tout le Royaume-Uni, en Espagne, au Portugal, en France, aux îles Baléares et aux îles Canaries.",
		"experiencedDriverTeam": "Notre équipe de chauffeurs expérimentés et professionnels est dédiée à s'assurer que vos colis et vos biens arrivent à destination à temps et en parfait état. Que ce soit un petit colis ou un service complet de déménagement, GotoVan est votre choix numéro un.",
		"priorityOfEfficiency": "Nous comprenons l'importance du temps, c'est pourquoi nous donnons la priorité à un service rapide et efficace. En utilisant les dernières technologies de suivi et de surveillance, nous vous tenons informé et vous avez la certitude que votre colis est entre de bonnes mains.",
		"commitmentToCustomerService": "Notre engagement envers un service client exceptionnel et notre connaissance approfondie de l'industrie du transport ont fait de GotoVan le choix préféré tant pour les particuliers que pour les entreprises. Rejoignez-nous pour découvrir la différence qu'un service de qualité peut apporter.",
		"dedicatedTeamTransport": "Chaque semaine, notre équipe dévouée travaille sans relâche pour transporter des colis et des déménagements entre le Royaume-Uni, la France et l'Espagne. Des collectes à travers le Royaume-Uni les jeudis et vendredis à un voyage soigneusement planifié à travers la France pour atteindre l'Espagne le lundi, nous garantissons une expérience fluide et sans tracas.",
		"dedicatedToDeliveringItems": "Peu importe la taille de votre envoi, GotoVan s'engage à livrer les articles en toute sécurité et à temps, en connectant les entreprises et les particuliers de manière transparente à travers les frontières. Faites-nous confiance pour des services de coursier fiables et efficaces, où que votre colis doit aller."
	},
	"features": {
		"qualityService": "Service de qualité",
		"familyOwnedBusiness": "Entreprise familiale",
		"flexibility": "Flexibilité",
		"liveTracking": "Suivi en direct",
		"serviceDescription": "Nous offrons un service <statsText>de première qualité</statsText> avec collecte et livraison jusque devant votre porte.",
		"businessPride": "Nous sommes fiers de gérer cette entreprise comme une <statsText>famille</statsText>, en livrant nos services avec succès.",
		"humanTouch": "Nous sommes humains, et cela signifie que <statsText>nous sommes là</statsText> pour rester en contact avec vous à chaque étape.",
		"stayInformed": "<statsText>Restez informé</statsText> à chaque étape.",
		"comingSoon": "PROCHAINEMENT"
	},
	"experienceYears": "Plus de <span>{{years}}</span> ans d'expérience",
	"": ""
}