[
  {
    "path": "nav.home",
    "en": "Home",
    "es": "Inicio",
    "fr": "Accueil"
  },
  {
    "path": "nav.projects",
    "en": "Projects",
    "es": "Proyectos",
    "fr": "Projets"
  },
  {
    "path": "nav.resume",
    "en": "Resume",
    "es": "Currículum",
    "fr": "Résumé"
  },
  {
    "path": "nav.opensource",
    "en": "Open Source",
    "es": "Código Abierto",
    "fr": "Open Source"
  },
  {
    "path": "nav.articles",
    "en": "Articles",
    "es": "Artículos",
    "fr": "Articles"
  },
  {
    "path": "nav.about",
    "en": "About",
    "es": "Sobre mí",
    "fr": "À propos"
  },
  {
    "path": "nav.creative",
    "en": "Creative",
    "es": "Creatividad",
    "fr": "Créativité"
  },
  {
    "path": "nav.contact",
    "en": "Contact",
    "es": "Contacto",
    "fr": "Contact"
  },
  {
    "path": "nav.commandPaletteHint",
    "en": "Press Cmd / Ctrl + K to explore",
    "es": "Pulsa Cmd / Ctrl + K para investigar",
    "fr": "Appuyez sur Cmd / Ctrl + K pour naviguer"
  },
  {
    "path": "hero.title",
    "en": "Multi-Domain Software Engineer",
    "es": "Ingeniero Elite Multi-Dominio",
    "fr": "Ingénieur Élite Multi-Domaines"
  },
  {
    "path": "hero.subtitle",
    "en": "Building high-performance systems. Specialised in Quantitative Trading (Python and C++), AI-Driven Intelligence (Python), and Web3 Architecture (Solidity).",
    "es": "Arquitectando sistemas de alto rendimiento. Especializado en Trading Cuantitativo (Python y C++), Inteligencia Artificial (Python) y Arquitectura Web3 (Solidity).",
    "fr": "Architecte de systèmes haute performance. Spécialisé en Trading Quantitatif (Python et C++), Intelligence Artificielle (Python) et Architecture Web3 (Solidity)."
  },
  {
    "path": "hero.viewProjects",
    "en": "View Projects",
    "es": "Ver Proyectos",
    "fr": "Voir les Projets"
  },
  {
    "path": "hero.downloadResume",
    "en": "Download Resume",
    "es": "Descargar CV",
    "fr": "Télécharger le CV"
  },
  {
    "path": "hero.status",
    "en": "Open for world-class opportunities",
    "es": "Abierto a oportunidades de categoría mundial",
    "fr": "Ouvert aux opportunités de classe mondiale"
  },
  {
    "path": "specializations.title",
    "en": "Core Specializations",
    "es": "Especializaciones Principales",
    "fr": "Spécialisations Principales"
  },
  {
    "path": "specializations.backend.title",
    "en": "Backend Engineering",
    "es": "Ingeniería Backend",
    "fr": "Ingénierie Backend"
  },
  {
    "path": "specializations.backend.description",
    "en": "Highly scalable distributed systems and microservices architecture.",
    "es": "Sistemas distribuidos altamente escalables y arquitectura de microservicios.",
    "fr": "Systèmes distribués hautement évolutifs et architecture de microservices."
  },
  {
    "path": "specializations.quant.title",
    "en": "Quant / Trading",
    "es": "Quant / Trading",
    "fr": "Quant / Trading"
  },
  {
    "path": "specializations.quant.description",
    "en": "low-mid frequency trading systems and algorithmic financial statistical models.",
    "es": "Sistemas de trading de baja-media frecuencia y modelos estadísticos algorítmicos financieros.",
    "fr": "Systèmes de trading à fréquence basse/moyenne et modèles statistiques financiers algorithmiques."
  },
  {
    "path": "specializations.web3.title",
    "en": "Web3 / Blockchain",
    "es": "Web3 / Blockchain",
    "fr": "Web3 / Blockchain"
  },
  {
    "path": "specializations.web3.description",
    "en": "Smart contracts, DAO governance, and decentralized finance protocols.",
    "es": "Contratos inteligentes, gobernanza DAO y protocolos de finanzas descentralizadas.",
    "fr": "Contrats intelligents, gouvernance DAO et protocoles de finance décentralisée."
  },
  {
    "path": "specializations.ai.title",
    "en": "AI / ML Engineering",
    "es": "Ingeniería en IA / ML",
    "fr": "Ingénierie IA / ML"
  },
  {
    "path": "specializations.ai.description",
    "en": "Neural Networks, Transformers, Computer Vision, data processing pipelines.",
    "es": "Redes neuronales, Transformers, visión artificial, pipelines de procesamiento de datos.",
    "fr": "Réseaux neuronaux, Transformers, vision par ordinateur, pipelines de traitement de données."
  },
  {
    "path": "specializations.web.title",
    "en": "Fullstack Web",
    "es": "Desarrollo Web Fullstack",
    "fr": "Développement Web Fullstack"
  },
  {
    "path": "specializations.web.description",
    "en": "Premium user interfaces with high performance and interactive animations.",
    "es": "Interfaces de usuario premium de alto rendimiento y animaciones interactivas.",
    "fr": "Interfaces utilisateur premium avec hautes performances et animations interactives."
  },
  {
    "path": "home.stats.years",
    "en": "Years Exp.",
    "es": "Años Exp.",
    "fr": "Années Exp."
  },
  {
    "path": "home.stats.projects",
    "en": "Projects",
    "es": "Proyectos",
    "fr": "Projets"
  },
  {
    "path": "home.stats.certs",
    "en": "Professional Certs",
    "es": "Certificaciones Prof.",
    "fr": "Certifs Prof."
  },
  {
    "path": "home.stats.languages",
    "en": "Languages",
    "es": "Idiomas",
    "fr": "Langues"
  },
  {
    "path": "home.featuredProjects.title",
    "en": "Featured Projects",
    "es": "Proyectos Destacados",
    "fr": "Projets Vedettes"
  },
  {
    "path": "home.featuredProjects.subtitle",
    "en": "A selection of high-impact engineering challenges and technological breakthroughs.",
    "es": "Una selección de desafíos de ingeniería de alto impacto y avances tecnológicos.",
    "fr": "Une sélection de défis d'ingénierie à fort impact et de percées technologiques."
  },
  {
    "path": "home.featuredProjects.viewAll",
    "en": "All Projects",
    "es": "Todos los Proyectos",
    "fr": "Tous les Projets"
  },
  {
    "path": "home.insights.title",
    "en": "Engineering Insights",
    "es": "Perspectivas de Ingeniería",
    "fr": "Perspectives d'Ingénierie"
  },
  {
    "path": "home.insights.subtitle",
    "en": "Deep dives into low-latency systems, multi-agent AI, and production-grade architecture.",
    "es": "Inmersiones profundas en sistemas de baja latencia, IA multi-agente y arquitectura de grado de producción.",
    "fr": "Plongeons profonds dans les systèmes à faible latence, l'IA multi-agents et l'architecture de classe production."
  },
  {
    "path": "home.insights.viewAll",
    "en": "View All Articles",
    "es": "Ver todos los Artículos",
    "fr": "Voir tous les Articles"
  },
  {
    "path": "home.insights.readMore",
    "en": "Read More",
    "es": "Leer más",
    "fr": "Lire plus"
  },
  {
    "path": "about.title",
    "en": "The Mind Behind The Code",
    "es": "La Mente Detrás del Código",
    "fr": "L'Esprit Derrière le Code"
  },
  {
    "path": "about.subtitle.layers",
    "en": "6+ Years Building Products",
    "es": "6+ Años Construyendo Productos",
    "fr": "6+ Ans de Construction de Produits"
  },
  {
    "path": "about.subtitle.activity",
    "en": "From Idea → Production",
    "es": "De Idea → Producción",
    "fr": "De l'Idée → Production"
  },
  {
    "path": "about.subtitle.search",
    "en": "Fueled by Curiosity",
    "es": "Impulsado por la Curiosidad",
    "fr": "Alimenté por la Curiosité"
  },
  {
    "path": "about.subtitle.target",
    "en": "Product-Focused Engineer",
    "es": "Ingeniero Enfocado en el Producto",
    "fr": "Ingénieur Axé sur le Produit"
  },
  {
    "path": "about.description[0]",
    "en": "I'm a software engineer and electronics engineer with a passion for building ideas into products. I have a strong background in software development, AI development, and applying math to trading systems. I am a quick learner and can pick up new technologies quickly. I am also a team player and enjoy working in a collaborative environment.",
    "es": "Soy un ingeniero de software e ingeniero electrónico con una pasión por convertir ideas en productos. Tengo una sólida formación en desarrollo de software, desarrollo de IA y aplicación de matemáticas a sistemas de trading. Aprendo rápido y puedo dominar nuevas tecnologías con agilidad. También sé trabajar en equipo y disfruto de los entornos colaborativos.",
    "fr": "Je suis un ingénieur logiciel et un ingénieur en électronique passionné par la transformation d'idées en produits. J'ai une solide formation en développement de logiciels, en développement d'IA et en application des mathématiques aux systèmes de trading. J'apprends vite et je peux maîtriser de nouvelles technologies rapidement. Je suis également un joueur d'équipe et j'aime travailler dans un environnement collaboratif."
  },
  {
    "path": "about.description[1]",
    "en": "I believe my purpose in life is to make the world a better place by building technology.",
    "es": "Creo que mi propósito en la vida es hacer del mundo un lugar mejor construyendo tecnología.",
    "fr": "Je crois que mon but dans la vie est de rendre le monde meilleur en construisant de la technologie."
  },
  {
    "path": "about.description[2]",
    "en": "I am at my best when I am solving hard problems. Contributing to something bigger than myself.",
    "es": "Doy lo mejor de mí cuando resuelvo problemas difíciles. Contribuir a algo más grande que yo mismo.",
    "fr": "Je suis au sommet de mon art quand je résous des problèmes difficiles. Contribuer à quelque chose de plus grand que moi-même."
  },
  {
    "path": "about.description[3]",
    "en": "Currently I spend my time building platforms, developing AI projects, trading crypto and developing my discipline.",
    "es": "Actualmente dedico mi tiempo a construir plataformas, desarrollar proyectos de IA, operar con criptomonedas y desarrollar mi disciplina.",
    "fr": "Actuellement, je passe mon temps à construire des plateformes, à développer des projets d'IA, à trader des cryptos et à développer ma discipline."
  },
  {
    "path": "about.description[4]",
    "en": "I am looking to join a team of like-minded people who want to change the world one step at a time.",
    "es": "Busco unirme a un equipo de personas con ideas afines que quieran cambiar el mundo paso a paso.",
    "fr": "Je cherche à rejoindre une équipe de personnes partageant les mêmes idées qui veulent changer le monde étape par étape."
  },
  {
    "path": "about.philosophy.title",
    "en": "My Philosophy",
    "es": "Mi Filosofía",
    "fr": "Ma Philosophie"
  },
  {
    "path": "about.philosophy.engineering.title",
    "en": "Engineering Excellence",
    "es": "Excelencia en Ingeniería",
    "fr": "Excellence en Ingénierie"
  },
  {
    "path": "about.philosophy.engineering.desc",
    "en": "Following best practices and highest performance standards is my personal obsession. I apply rigorous engineering principles to ensure every system is optimized, secure, and built to last.",
    "es": "Seguir las mejores prácticas y los más altos estándares de rendimiento es mi obsesión personal. Aplico principios de ingeniería rigurosos para asegurar que cada sistema esté optimizado, sea seguro y esté construido para durar.",
    "fr": "Suivre les meilleures pratiques et les normes de performance les plus élevées est mon obsession personnelle. J'applique des principes d'ingénierie rigoureux pour m'assurer que chaque système est optimisé, sécurisé et construit pour durer."
  },
  {
    "path": "about.philosophy.antifragile.title",
    "en": "Anti-Fragile Design",
    "es": "Diseño Antifrágil",
    "fr": "Conception Anti-Fragile"
  },
  {
    "path": "about.philosophy.antifragile.desc",
    "en": "Engineered for correctness from the first line. My background in design verification and validation allows me to build robust, anti-fragile systems with a 'design for failure' mindset, ensuring reliability where it matters most.",
    "es": "Diseñado para la corrección desde la primera línea. Mi experiencia en verificación y validación de diseños me permite construir sistemas robustos y antifrágiles con una mentalidad de 'diseño para el fallo', garantizando la fiabilidad donde más importa.",
    "fr": "Conçu pour la justesse dès la première ligne. Mon expérience en vérification et validation de conception me permet de construire des systèmes robustes et anti-fragiles avec un état d'esprit de 'conception pour l'échec', garantissant la fiabilité là où elle compte le plus."
  },
  {
    "path": "about.philosophy.agentic.title",
    "en": "The Agentic Shift",
    "es": "El Cambio Agéntico",
    "fr": "Le Virage Agentique"
  },
  {
    "path": "about.philosophy.agentic.desc",
    "en": "Moving from passive tools to active agents. I focus on autonomous architectures that plan, reason, and execute complex workflows independently.",
    "es": "Pasar de herramientas pasivas a agentes activos. Me enfoco en arquitecturas autónomas que planifican, razonan y ejecutan flujos de trabajo complejos de forma independiente.",
    "fr": "Passer des outils passifs aux agents actifs. Je me concentre sur des architectures autonomes qui planifient, raisonnent et exécutent des flux de travail complexes de manière indépendante."
  },
  {
    "path": "about.philosophy.clean.title",
    "en": "Clean Architecture",
    "es": "Arquitectura Limpia",
    "fr": "Architecture Propre"
  },
  {
    "path": "about.philosophy.clean.desc",
    "en": "Code is for humans to read and machines to execute. I build modular systems that are as maintainable as they are powerful.",
    "es": "El código es para que lo lean los humanos y las máquinas lo ejecuten. Construyo sistemas modulares que son tan mantenibles como potentes.",
    "fr": "Le code est fait pour être lu par les humains et exécuté par les machines. Je construis des systèmes modulaires aussi faciles à maintenir qu'ils sont puissants."
  },
  {
    "path": "about.philosophy.strategic.title",
    "en": "Strategic Depth",
    "es": "Profundidad Estratégica",
    "fr": "Profondeur Stratégique"
  },
  {
    "path": "about.philosophy.strategic.desc",
    "en": "Beyond the code lies the mission. I approach every project with a long-term vision, ensuring today's solutions scale and serve a purpose.",
    "es": "Más allá del código está la misión. Abordo cada proyecto con una visión a largo plazo, asegurando que las soluciones de hoy escalen y cumplan un propósito.",
    "fr": "Au-delà du code se trouve la mission. J'aborde chaque projet avec une vision à long terme, en m'assurant que les solutions d'aujourd'hui sont évolutives et servent un but."
  },
  {
    "path": "about.philosophy.user.title",
    "en": "User Centric",
    "es": "Centrado en el Usuario",
    "fr": "Centré sur l'Utilisateur"
  },
  {
    "path": "about.philosophy.user.desc",
    "en": "Great minds are capable of turning complex ideas into simple and elegant solutions. I bridge the gap between complex systems and intuitive user experiences.",
    "es": "Las grandes mentes son capaces de convertir ideas complejas en soluciones simples y elegantes. Cierro la brecha entre los sistemas complejos y las experiencias de usuario intuitivas.",
    "fr": "Les grands esprits sont capables de transformer des idées complexes en solutions simples et élégantes. Je comble le fossé entre les systèmes complexes et les expériences utilisateur intuitives."
  },
  {
    "path": "about.philosophy.precision.title",
    "en": "Artistic Precision",
    "es": "Precisión Artística",
    "fr": "Précision Artistique"
  },
  {
    "path": "about.philosophy.precision.desc",
    "en": "I build systems with intricate detail and structural elegance, where every line of code serves a clear purpose.",
    "es": "Construyo sistemas con detalles intrincados y elegancia estructural, donde cada línea de código cumple un propósito claro.",
    "fr": "Je construis des systèmes avec des détails complexes et une élégance structurelle, où chaque ligne de code sert un objectif clair."
  },
  {
    "path": "about.philosophy.data.title",
    "en": "Data as Narrative",
    "es": "Los Datos como Narrativa",
    "fr": "La Donnée comme Récit"
  },
  {
    "path": "about.philosophy.data.desc",
    "en": "Every dataset tells a story. I build pipelines that transform raw noise into clear, actionable signals for human and machine understanding.",
    "es": "Cada conjunto de datos cuenta una historia. Construyo canales que transforman el ruido crudo en señales claras y accionables para la comprensión humana y de las máquinas.",
    "fr": "Chaque ensemble de données raconte une histoire. Je construis des pipelines qui transforment le bruit brut en signaux clairs et exploitables pour la compréhension humaine et machine."
  },
  {
    "path": "about.philosophy.curiosity.title",
    "en": "Spark of Curiosity",
    "es": "Chispa de Curiosidad",
    "fr": "Étincelle de Curiosité"
  },
  {
    "path": "about.philosophy.curiosity.desc",
    "en": "The 'Why' is as important as the 'How'. Constant experimentation and a beginner's mind keep the engineering process fresh and vibrant.",
    "es": "El 'Por qué' es tan importante como el 'Cómo'. La experimentación constante y una mente de principiante mantienen el proceso de ingeniería fresco y vibrante.",
    "fr": "Le 'Pourquoi' est aussi important que le 'Comment'. L'expérimentation constante et un esprit de débutant maintiennent le processus d'ingénierie frais et vibrant."
  },
  {
    "path": "articles.title",
    "en": "Insights & Articles",
    "es": "Perspectivas y Artículos",
    "fr": "Perspectives et Articles"
  },
  {
    "path": "articles.subtitle",
    "en": "Deep dives into engineering challenges, architectural patterns, and the future of technology.",
    "es": "Inmersiones profundas en desafíos de ingeniería, patrones arquitectónicos y el futuro de la tecnología.",
    "fr": "Plongeons profonds dans les défis d'ingénierie, les modèles architecturaux et l'avenir de la technologie."
  },
  {
    "path": "articles.back",
    "en": "Back to Articles",
    "es": "Volver a Artículos",
    "fr": "Retour aux Articles"
  },
  {
    "path": "articles.readFull",
    "en": "Read Full Article",
    "es": "Leer Artículo Completo",
    "fr": "Lire l'Article Complet"
  },
  {
    "path": "articles.share",
    "en": "Share Article",
    "es": "Compartir Artículo",
    "fr": "Partager l'Article"
  },
  {
    "path": "articles.discuss",
    "en": "Discuss with me",
    "es": "Comentar conmigo",
    "fr": "Discuter avec moi"
  },
  {
    "path": "articles.toc",
    "en": "Table of Contents",
    "es": "Tabla de Contenidos",
    "fr": "Table des Matières"
  },
  {
    "path": "contact.title",
    "en": "Let's Build The Future",
    "es": "Construyamos El Futuro",
    "fr": "Construisons L'Avenir"
  },
  {
    "path": "contact.subtitle",
    "en": "Have a project in mind? Drop me a message and I'll get back to you within 24 hours.",
    "es": "¿Tienes un proyecto en mente? Envíame un mensaje y te responderé en 24 horas.",
    "fr": "Vous avez un projet en tête ? Laissez-moi un message et je vous répondrai dans les 24 heures."
  },
  {
    "path": "contact.emailTitle",
    "en": "Email Me",
    "es": "Envíame un Correo",
    "fr": "Envoyez-moi un E-mail"
  },
  {
    "path": "contact.callTitle",
    "en": "Call Me",
    "es": "Llámame",
    "fr": "Appelez-moi"
  },
  {
    "path": "contact.socialsTitle",
    "en": "Socials",
    "es": "Redes Sociales",
    "fr": "Réseaux Sociaux"
  },
  {
    "path": "contact.whatsappTitle",
    "en": "Skip the email.",
    "es": "Sáltate el correo.",
    "fr": "Passez l'e-mail."
  },
  {
    "path": "contact.whatsappDesc",
    "en": "I'm most responsive on WhatsApp. Click below to start a conversation directly with me.",
    "es": "Respondo más rápido por WhatsApp. Haz clic abajo para iniciar una conversación directamente conmigo.",
    "fr": "Je suis plus réactif sur WhatsApp. Cliquez ci-dessous pour démarrer une conversation directement avec moi."
  },
  {
    "path": "contact.whatsappButton",
    "en": "Message on WhatsApp",
    "es": "Mensaje en WhatsApp",
    "fr": "Message sur WhatsApp"
  },
  {
    "path": "projects.ui.backToGallery",
    "en": "Back to Gallery",
    "es": "Volver a la Galería",
    "fr": "Retour à la Galerie"
  },
  {
    "path": "projects.ui.theChallenge",
    "en": "The Challenge",
    "es": "El Desafío",
    "fr": "Le Défi"
  },
  {
    "path": "projects.ui.theSolution",
    "en": "The Solution",
    "es": "La Solución",
    "fr": "La Solution"
  },
  {
    "path": "projects.ui.techStack",
    "en": "Tech Stack",
    "es": "Stack Tecnológico",
    "fr": "Stack Technologique"
  },
  {
    "path": "projects.ui.keyMetrics",
    "en": "Key Metrics",
    "es": "Métricas Clave",
    "fr": "Métriques Clés"
  },
  {
    "path": "projects.ui.furtherReading",
    "en": "Further Reading",
    "es": "Lectura Adicional",
    "fr": "Lectures Complémentaires"
  },
  {
    "path": "projects.ui.technicalArticle",
    "en": "Technical Article",
    "es": "Artículo Técnico",
    "fr": "Article Technique"
  },
  {
    "path": "projects.ui.furtherReadingDesc",
    "en": "For a deep dive into the technical implementation and architecture of this project, read the full article.",
    "es": "Para profundizar en la implementación técnica y la arquitectura de este proyecto, lea el artículo completo.",
    "fr": "Pour une plongée approfondie dans l'implémentation technique et l'architecture de ce projet, lisez l'article complet."
  },
  {
    "path": "projects.ui.viewCaseStudy",
    "en": "View Case Study",
    "es": "Ver Caso de Estudio",
    "fr": "Voir l'Étude de Cas"
  },
  {
    "path": "projects.ui.relatedProjects",
    "en": "Related Projects",
    "es": "Proyectos Relacionados",
    "fr": "Projets Connexes"
  },
  {
    "path": "projects.ui.demo",
    "en": "Demo",
    "es": "Demo",
    "fr": "Démo"
  },
  {
    "path": "projects.ui.code",
    "en": "Code",
    "es": "Código",
    "fr": "Code"
  },
  {
    "path": "projects.cryptogpt.title",
    "en": "CryptoGPT",
    "es": "CryptoGPT",
    "fr": "CryptoGPT"
  },
  {
    "path": "projects.cryptogpt.description",
    "en": "Custom transformer model trained on ranging market volume data.",
    "es": "Modelo de transformador personalizado entrenado con datos de volumen en mercados en rango.",
    "fr": "Modèle de transformateur personnalisé entraîné sur des données de volume de marché en range."
  },
  {
    "path": "projects.cryptogpt.longDescription",
    "en": "Custom-trained transformer model on extensive crypto-financial volume datasets to create an accurate model for financial markets.",
    "es": "Modelo de transformador entrenado con extensos conjuntos de datos de volumen criptofinancieros para crear un modelo preciso para los mercados financieros.",
    "fr": "Modèle de transformateur personnalisé entraîné sur de vastes ensembles de données de volume crypto-financier pour créer un modèle précis pour les marchés financiers."
  },
  {
    "path": "projects.cryptogpt.challenge",
    "en": "Developing a model that could accurately predict market direction in 'low-volatility' environments where traditional indicators fail. The goal was to bypass time-series analysis and apply modern machine learning techniques to predict market direction. The core challenge: market data does not follow a Gaussian distribution, rendering most machine learning models inadequate for the task.",
    "es": "Desarrollar un modelo que pudiera predecir la dirección del mercado en entornos de 'baja volatilidad' donde los indicadores tradicionales fallan. El objetivo era eludir el análisis de series temporales y aplicar técnicas modernas de aprendizaje automático para predecir la dirección del mercado. El desafío central: los datos del mercado no siguen una distribución gaussiana, lo que hace que la mayoría de los modelos formales sean inadecuados para la tarea.",
    "fr": "Développer un modèle capable de prédire précisément la direction du marché dans les environnements de 'faible volatilité' où les indicateurs traditionnels échouent. Le but était de contourner l'analyse des séries temporelles et d'appliquer des techniques d'apprentissage automatique modernes pour prédire la direction du marché. Le défi central : les données de marché ne suivent pas une distribution gaussienne, rendant la plupart des modèles d'apprentissage automatique inadaptés pour la tâche."
  },
  {
    "path": "projects.cryptogpt.solution",
    "en": "Implemented a custom Transformer architecture trained on market volume data, utilising multi-head attention to capture subtle correlation patterns. The key to the approach lies in the feature engineering: by capturing time windows where linear regressions have an almost horizontal slope, the model observes periods where volume profiles most closely resemble a Gaussian distribution — ensuring the data is structurally consistent rather than random price noise.",
    "es": "Se implementó una arquitectura Transformer personalizada entrenada con datos de volumen del mercado, utilizando atención multicabezal para capturar patrones de correlación sutiles. La clave del enfoque radicó en la ingeniería de características: al capturar ventanas de tiempo donde las regresiones lineales tienen una pendiente casi horizontal, el modelo observa períodos donde los perfiles de volumen se asemejan más a una distribución gaussiana — asegurando que los datos sean estructuralmente consistentes en lugar de simple ruido de precios.",
    "fr": "Mise en œuvre d'une architecture Transformer personnalisée entraînée sur des données de volume de marché, utilisant l'attention multi-têtes pour capturer des modèles de corrélation subtils. La clé réside dans l'ingénierie des caractéristiques : en capturant des fenêtres temporelles où les régressions linéaires ont une pente presque horizontale, le modèle observe des périodes où les profils de volume ressemblent le plus à une distribution gaussienne — s'assurant que les données sont structurellement cohérentes plutôt que du simple bruit de prix aléatoire."
  },
  {
    "path": "projects.cryptogpt.achievements[0]",
    "en": "60.4% accuracy on unseen data",
    "es": "60.4% de precisión en datos no vistos",
    "fr": "60.4% de précision sur des données non vues"
  },
  {
    "path": "projects.cryptogpt.achievements[1]",
    "en": "Implemented real-time feature engineering pipeline",
    "es": "Implementación de pipeline de ingeniería de características en tiempo real",
    "fr": "Mise en œuvre d'un pipeline d'ingénierie des caractéristiques en temps réel"
  },
  {
    "path": "projects.cryptogpt.achievements[2]",
    "en": "Scalable training on multiple CPU cores and 100% of GPU capacity",
    "es": "Entrenamiento escalable en múltiples núcleos de CPU y 100% de capacidad de GPU",
    "fr": "Entraînement évolutif sur plusieurs cœurs de CPU et 100% de la capacité GPU"
  },
  {
    "path": "projects.cryptogpt.achievements[3]",
    "en": "Validated model generalisation without overfitting — works for any cryptocurrency asset",
    "es": "Validación de la generalización del modelo sin sobreajuste — funciona para cualquier criptoactivo",
    "fr": "Généralisation du modèle validée sans surapprentissage — fonctionne pour tout actif crypto"
  },
  {
    "path": "projects.cryptogpt.metrics.accuracy",
    "en": "Accuracy on Unseen Data",
    "es": "Precisión en Datos no Vistos",
    "fr": "Précision sur les Données non Vues"
  },
  {
    "path": "projects.cryptogpt.metrics.gpuEfficiency",
    "en": "GPU Efficiency During Training",
    "es": "Eficiencia de GPU durante Entrenamiento",
    "fr": "Efficacité GPU pendant l'Entraînement"
  },
  {
    "path": "projects.toptrader.title",
    "en": "TopTrader Platform",
    "es": "Plataforma TopTrader",
    "fr": "Plateforme TopTrader"
  },
  {
    "path": "projects.toptrader.description",
    "en": "Smart trading platform focused on discipline for crypto with automated market screening, sentiment analysis and risk management.",
    "es": "Plataforma de trading inteligente enfocada en la disciplina para criptomonedas con escáner de mercado automatizado, análisis de sentimiento y gestión de riesgos.",
    "fr": "Plateforme de trading intelligente axée sur la discipline crypto avec sélection automatisée du marché, analyse des sentiments et gestion des risques."
  },
  {
    "path": "projects.toptrader.longDescription",
    "en": "They say trading is 90% psychology and 10% strategy. Yet all platforms focus 100% on strategy, completely ignoring psychology. TopTrader merges all trading accounts into one platform, offering automated market screening, risk management, algorithm execution, journalling, behavioural analysis and a unified trading experience.",
    "es": "Dicen que el trading es 90% psicología y 10% estrategia. Sin embargo, todas las plataformas se centran al 100% en la estrategia, ignorando por completo la psicología. TopTrader fusiona todas las cuentas de trading en una sola plataforma, ofreciendo escaneo automático de mercado, gestión de riesgos, ejecución de algoritmos, diario, análisis de comportamiento y una experiencia de trading unificada.",
    "fr": "On dit que le trading est composé à 90% de psychologie et à 10% de stratégie. Pourtant, toutes les plateformes se concentrent à 100% sur la stratégie, ignorant complètement la psychologie. TopTrader fusionne tous les comptes de trading en une seule plateforme, offrant une analyse automatisée du marché, la gestion des risques, l'exécution d'algorithmes, la tenue d'un journal, l'analyse comportementale et une expérience de trading unifiée."
  },
  {
    "path": "projects.toptrader.challenge",
    "en": "Fragmented trading tools and emotional decision-making often lead to inconsistent results for retail and professional traders alike. By building discipline into the trading interface itself, retail traders gain guardrails that prevent impulsive decisions and support the psychological aspects of trading.",
    "es": "Las herramientas de trading fragmentadas y la toma de decisiones emocionales a menudo conducen a resultados inconsistentes tanto para traders minoristas como profesionales. Al integrar la disciplina en la propia interfaz de trading, los traders obtienen medidas de seguridad que evitan decisiones impulsivas y respaldan los aspectos psicológicos del trading.",
    "fr": "Les outils de trading fragmentés et la prise de décision émotionnelle entraînent souvent des résultats incohérents, tant pour les traders particuliers que professionnels. En intégrant la discipline dans l'interface de trading elle-même, les traders obtiennent des garde-fous qui préviennent les décisions impulsives et soutiennent les aspects psychologiques du trading."
  },
  {
    "path": "projects.toptrader.solution",
    "en": "TopTrader merges all trading accounts into one platform, offering automated market screening, risk management, algorithm execution, journalling, behavioural analysis, and a unified trading experience. It integrates with every major cryptocurrency exchange via the CCXT library. Automated market screening constantly scans the entire cryptocurrency market for new opportunities based on multi-signal strategies, saving users countless hours. Emotional regulation exercises and extensive journalling are enforced for each trade, ensuring users remain disciplined. Algorithms can be activated and monitored in real-time, reducing decision fatigue. Extensive behavioural insights help users improve the psychological aspects of their trading. Over a hundred educational videos take users from beginner to expert.",
    "es": "TopTrader unifica todas las cuentas en una plataforma. Se integra con las principales bolsas de criptomonedas a través de la biblioteca CCXT. El escáner de mercado automatizado analiza constantemente el mercado buscando nuevas oportunidades basadas en estrategias multiseñal, ahorrando incontables horas. Se aplican ejercicios de regulación emocional y un registro detallado de cada operación para garantizar que los usuarios mantengan la disciplina. Los algoritmos se pueden activar y monitorear en tiempo real, reduciendo la fatiga de decisiones. Los extensos análisis de comportamiento ayudan a los usuarios a mejorar su psicología. Más de cien videos educativos llevan a los usuarios de principiantes a expertos.",
    "fr": "TopTrader fusionne tous les comptes de trading dans une seule plateforme. Elle s'intègre avec tous les grands échanges via la bibliothèque CCXT. L'analyse automatisée parcourt le marché entier pour trouver de nouvelles opportunités. Des exercices de régulation émotionnelle et un journal très détaillé sont obligatoires, ce qui garantit la discipline. Les algorithmes peuvent être gérés de façon automatique. Des informations comportementales approfondies aident les utilisateurs à améliorer l'aspect psychologique. Enfin, il y a de nombreuses vidéos pédagogiques."
  },
  {
    "path": "projects.toptrader.achievements[0]",
    "en": "Integrates with +100 crypto exchanges for real-time execution",
    "es": "Se integra con +100 bolsas de criptomonedas para ejecución en tiempo real",
    "fr": "S'intègre avec +100 échanges de crypto pour une exécution en temps réel"
  },
  {
    "path": "projects.toptrader.achievements[1]",
    "en": "Runs multiple algorithms simultaneously",
    "es": "Ejecuta múltiples algoritmos simultáneamente",
    "fr": "Exécute plusieurs algorithmes simultanément"
  },
  {
    "path": "projects.toptrader.achievements[2]",
    "en": "Completely automated trade execution and position sizing for correct risk management",
    "es": "Ejecución de operaciones y tamaño de posición completamente automatizados para una correcta gestión del riesgo",
    "fr": "Exécution des transactions et dimensionnement des positions entièrement automatisés"
  },
  {
    "path": "projects.toptrader.achievements[3]",
    "en": "Comprehensive behavioural analysis and journalling",
    "es": "Análisis exhaustivo del comportamiento y registro (journalling)",
    "fr": "Analyse comportementale complète et journal (journalling)"
  },
  {
    "path": "projects.toptrader.metrics.marketScreening",
    "en": "Market Screening",
    "es": "Escaneo de Mercado",
    "fr": "Analyse du Marché"
  },
  {
    "path": "projects.toptrader.metrics.strategies",
    "en": "Profitable Strategies",
    "es": "Estrategias Rentables",
    "fr": "Stratégies Rentables"
  },
  {
    "path": "projects.toptrader.metrics.education",
    "en": "Educational Videos",
    "es": "Videos Educativos",
    "fr": "Vidéos Éducatives"
  },
  {
    "path": "projects.technex.title",
    "en": "Technex",
    "es": "Technex",
    "fr": "Technex"
  },
  {
    "path": "projects.technex.description",
    "en": "Leading software development and consulting firm.",
    "es": "Firma líder en consultoría y desarrollo de software.",
    "fr": "Cabinet de conseil et de développement logiciel de premier plan."
  },
  {
    "path": "projects.technex.longDescription",
    "en": "Founded Technex to provide high-end consultancy and bespoke software engineering, focusing on scalable cloud architectures and fintech solutions. We developed trading platforms, trading algorithms, analytics dashboards, and more for a variety of clients across the globe.",
    "es": "Se fundó Technex para proporcionar consultoría de alto nivel e ingeniería de software a medida, centrándose en arquitecturas en la nube escalables y soluciones fintech. Desarrollamos plataformas de trading, algoritmos, paneles analíticos y más para una variedad de clientes en todo el mundo.",
    "fr": "Technex a été fondée pour fournir du conseil de haut niveau et de l'ingénierie logicielle sur mesure, en se concentrant sur les architectures cloud évolutives et les solutions fintech. Nous avons développé des plateformes de trading, des algorithmes de trading, des tableaux de bord analytiques et bien plus pour divers clients à travers le monde."
  },
  {
    "path": "projects.technex.challenge",
    "en": "Few consistently profitable trading algorithms exist in the cryptocurrency space. Technex had 4 of them. Offering these investment vehicles to clients led many to request custom development projects instead of existing solutions — which gave rise to Technex as a software intelligence consultancy.",
    "es": "Existen muy pocos algoritmos de trading consistentemente rentables en el espacio de las criptomonedas. Technex tenía 4 de ellos. Ofrecer estos vehículos de inversión a los clientes hizo que muchos solicitaran proyectos de desarrollo personalizados en lugar de las soluciones existentes — lo que dio origen a Technex como consultora de inteligencia de software.",
    "fr": "Peu d'algorithmes de trading systématiquement rentables existent dans l'espace des crypto-monnaies. Technex en avait 4. Prêter ces algorithmes aux clients a incité beaucoup d'entre eux à demander des projets de développement personnalisés — ce qui a donné naissance à Technex en tant que cabinet de conseil en intelligence logicielle."
  },
  {
    "path": "projects.technex.solution",
    "en": "Founded Technex to provide high-end consultancy and bespoke software engineering, focusing on scalable cloud architectures and fintech solutions. We developed trading platforms, trading algorithms, analytics dashboards, and more for a variety of clients. We did business across the globe, with clients in the UK, US, Mexico, and Spain.",
    "es": "Se fundó Technex para proporcionar consultoría de alto nivel e ingeniería de software a medida, centrándose en arquitecturas en la nube escalables y soluciones fintech. Desarrollamos plataformas de trading, algoritmos, y más para clientes en el Reino Unido, Estados Unidos, México y España.",
    "fr": "Technex offre des solutions sur mesure. Nous avons travaillé avec divers clients au Royaume-Uni, aux États-Unis, au Mexique et en Espagne, développant de grandes architectures cloud, du trading, etc."
  },
  {
    "path": "projects.technex.achievements[0]",
    "en": "Engineered scalable backend architectures for fintech startups",
    "es": "Arquitecturas backend escalables diseñadas para startups fintech",
    "fr": "Architectures backend évolutives conçues pour les startups fintech"
  },
  {
    "path": "projects.technex.achievements[1]",
    "en": "Successfully delivered 5+ high-impact projects for clients across different industries",
    "es": "Entrega exitosa de 5+ proyectos de alto impacto para clientes en diferentes industrias",
    "fr": "Livraison réussie de 5+ projets à fort impact pour des clients de divers secteurs"
  },
  {
    "path": "projects.technex.achievements[2]",
    "en": "Established a reputation for technical excellence and reliability",
    "es": "Consolidación de una reputación de excelencia técnica y confiabilidad",
    "fr": "Établissement d'une réputation d'excellence technique et de fiabilité"
  },
  {
    "path": "projects.technex.achievements[3]",
    "en": "Reduced operational costs for clients by up to 40%",
    "es": "Reducción de costos operativos para clientes en hasta un 40%",
    "fr": "Réduction des coûts opérationnels pour les clients jusqu'à 40%"
  },
  {
    "path": "projects.technex.metrics.projectsDelivered",
    "en": "High-Impact Projects Delivered",
    "es": "Proyectos de Alto Impacto Entregados",
    "fr": "Projets à Fort Impact Livrés"
  },
  {
    "path": "projects.technex.metrics.countries",
    "en": "Countries Served",
    "es": "Países Atendidos",
    "fr": "Pays Desservis"
  },
  {
    "path": "projects.technexConsultancy.title",
    "en": "Freelance AI & Automation Consultancy",
    "es": "Consultora Freelance en IA y Automatización",
    "fr": "Conseil Indépendant en IA et Automatisation"
  },
  {
    "path": "projects.technexConsultancy.description",
    "en": "Specialized AI and automation consultancy services to streamline bottleneck processes for companies.",
    "es": "Servicios especializados de consultoría en IA y automatización para agilizar procesos de cuello de botella empresariales.",
    "fr": "Services spécialisés de conseil en IA et automatisation pour rationaliser les processus de goulot d'étranglement des entreprises."
  },
  {
    "path": "projects.technexConsultancy.longDescription",
    "en": "Offered expert AI and automation consultancy services to streamline bottleneck processes for various companies, focusing on operational efficiency and strategic integration of AI technologies.",
    "es": "Se ofrecieron servicios de consultoría experta en IA y automatización para agilizar cuellos de botella para diversas empresas, centrándose en la eficiencia operativa y la integración estratégica de tecnologías de IA.",
    "fr": "Offre de services experts de conseil en IA et en automatisation pour rationaliser les processus de goulot d'étranglement pour diverses entreprises, en mettant l'accent sur l'efficacité opérationnelle."
  },
  {
    "path": "projects.technexConsultancy.challenge",
    "en": "Many businesses lack the internal expertise to identify and automate repetitive, time-consuming manual processes using AI.",
    "es": "Muchas empresas carecen de la experiencia interna para identificar y automatizar procesos manuales repetitivos y lentos utilizando IA.",
    "fr": "De nombreuses entreprises manquent d'expertise interne pour automatiser les processus manuels fastidieux à l'aide de l'IA."
  },
  {
    "path": "projects.technexConsultancy.solution",
    "en": "Provided expert consultancy to identify bottleneck processes and implement custom AI-driven automation workflows using LLMs and n8n or Make by building custom agents.",
    "es": "Se proporcionó consultoría experta para identificar procesos estancados y ejecutar flujos de trabajo de automatización impulsados por IA personalizados utilizando LLMs y n8n o Make interactuando con agentes autónomos.",
    "fr": "Fourniture de conseils pour identifier les processus de goulot d'étranglement et mettre en œuvre des workflows d'automatisation et de grands modèles d'apprentissage (LLM), par exemple avec n8n."
  },
  {
    "path": "projects.technexConsultancy.achievements[0]",
    "en": "Automated core workflows for multiple SMEs",
    "es": "Automatización de flujos de trabajo centrales para múltiples PYMES",
    "fr": "L'automatisation des flux de travail de base pour plusieurs PME"
  },
  {
    "path": "projects.technexConsultancy.achievements[1]",
    "en": "Integrated custom LLM agents for data processing",
    "es": "Integración de agentes LLM personalizados para procesamiento de datos",
    "fr": "Intégration d'agents LLM personnalisés pour le traitement des données"
  },
  {
    "path": "projects.technexConsultancy.achievements[2]",
    "en": "Conducted comprehensive process auditing and optimisation",
    "es": "Auditoría integral de procesos y optimización",
    "fr": "Audit exhaustif"
  },
  {
    "path": "projects.technexConsultancy.achievements[3]",
    "en": "Improved operational throughput by an average of 60%",
    "es": "Mejora de la capacidad operativa en un promedio del 60%",
    "fr": "Amélioration de la capacité opérationnelle de 60%"
  },
  {
    "path": "projects.aitrader.title",
    "en": "AiTrader",
    "es": "AiTrader",
    "fr": "AiTrader"
  },
  {
    "path": "projects.aitrader.description",
    "en": "AI-powered trading assistant and market analysis platform.",
    "es": "Asistente de trading y analista de mercado impulsado por IA.",
    "fr": "Assistant de trading et plateforme d'analyse de marché par l'IA."
  },
  {
    "path": "projects.aitrader.longDescription",
    "en": "Developed AiTrader to leverage LLMs for market prediction and automated trade execution, providing users with a completely automated trading system that applies human-like intuition and reasoning to the markets.",
    "es": "Se desarrolló AiTrader para aprovechar los LLM en la predicción del mercado y la ejecución automatizada de operaciones, brindando a los usuarios un sistema de trading completamente automatizado que aplica razonamiento e intuición casi humanos.",
    "fr": "Développement d'AiTrader pour exploiter les LLM dans la prédiction marché et l'exécution automatisée, offrant une intelligence presque humaine."
  },
  {
    "path": "projects.aitrader.challenge",
    "en": "Most algorithmic systems are incapable of translating human intuition built by traders into the system. They are too rigid and lack the ability to adapt to changing market conditions. The objective was to implement a system that could orchestrate multiple agents performing different tasks while incorporating human-like reasoning.",
    "es": "La mayoría de los sistemas algorítmicos son incapaces de traducir la intuición humana incorporada por los traders al sistema. Son demasiado rígidos y carecen de adaptabilidad a las cambiantes condiciones del mercado. El objetivo era implementar un sistema capaz de orquestar múltiples agentes realizando tareas mientras incorporaban razonamientos cuasi humanos.",
    "fr": "Incapacité à capter l'intuition humaine dans les algorithmes. L'objectif était de faire coopérer des agents spécialisés dirigés par des LLM."
  },
  {
    "path": "projects.aitrader.solution",
    "en": "LLMs provided the solution. A system was developed to orchestrate multiple agents, each with its own specialisation. Agents and prompts were created by transcribing +130GB of trading course videos from one of the best traders in the cryptocurrency market — converted from video to audio, then to text, then to specialised topic material, and finally into prompts and agent context. The system was built using a modular architecture with a central orchestrator maintaining a single source of truth across all agents. Evaluator agents using different LLMs are interspersed throughout to ensure correctness.",
    "es": "Los LLM fueron la solución. Se desarrolló un sistema para orquestar múltiples agentes, cada uno con su especialización. Los agentes y prompts se crearon transcribiendo +130 GB de videos de cursos de un trader top de criptomonedas — reconvertido a texto, luego material clasificado por tema para formar el contexto de cada agente. Se usó una estructura modular y un orquestador que asegura una sola fuente de verdad para todos los agentes, y agentes evaluadores revisan el resultado.",
    "fr": "Système composé d'agents et sous-agents pour analyser le marché. Utilisé des transcripts de traders reconnus. Une source unique de vérité et un agent orchestrateur."
  },
  {
    "path": "projects.aitrader.achievements[0]",
    "en": "Single source of truth architecture across all agents",
    "es": "Arquitectura con una sola fuente de verdad en todos los agentes",
    "fr": "Source unique de vérité au sein des agents"
  },
  {
    "path": "projects.aitrader.achievements[1]",
    "en": "20+ specialised sub-agents orchestrated to perform different tasks",
    "es": "20+ sub-agentes especializados orquestados para diferentes tareas",
    "fr": "20+ agents travaillant en direct"
  },
  {
    "path": "projects.aitrader.achievements[2]",
    "en": "Monitoring dashboard to track agent performance",
    "es": "Panel de monitoreo del rendimiento de los agentes",
    "fr": "Tableau de bord IA"
  },
  {
    "path": "projects.aitrader.achievements[3]",
    "en": "Robust testing for LLMs and prompts following AI Engineering best practices",
    "es": "Pruebas sólidas y mejores prácticas de Ingeniería en IA para LLMs y prompts",
    "fr": "Tests rigoureux (AI engineering)"
  },
  {
    "path": "projects.aitrader.metrics.subAgents",
    "en": "Specialised Sub-Agents",
    "es": "Sub-Agentes Especializados",
    "fr": "Sous-Agents Déployés"
  },
  {
    "path": "projects.aitrader.metrics.llmFailRate",
    "en": "LLM Fail Rate",
    "es": "Tasa de Fallos de LLM",
    "fr": "Taux d'Échec LLM"
  },
  {
    "path": "projects.chainchampions.title",
    "en": "Chain Champions NFT Platform",
    "es": "Plataforma de NFTs Chain Champions",
    "fr": "Plateforme NFT Chain Champions"
  },
  {
    "path": "projects.chainchampions.description",
    "en": "Web3 gaming tournament platform with Solidity smart contracts for escrow, buy-ins, and payouts.",
    "es": "Plataforma de torneos de juegos Web3 con contratos inteligentes Solidity para custodia segura, buy-ins y pagos.",
    "fr": "Plateforme esports Web3 et contrats intelligents Solidity pour le dépôt fiduciaire et gains."
  },
  {
    "path": "projects.chainchampions.longDescription",
    "en": "An NFT-driven tournament platform where users can compete in blockchain-based gaming. Features secure smart contracts for managing entry fees and automated distribution of prize pools, all running on a scalable cloud infrastructure.",
    "es": "Una plataforma de torneos impulsada por NFT donde los usuarios pueden competir en juegos basados en blockchain. Cuenta con contratos inteligentes seguros para la gestión de las tarifas de entrada y distribución automatizada de botes de premios.",
    "fr": "Plateforme de tournois NFT (eSports). Entièrement gérée par SC (Smart Contracts)."
  },
  {
    "path": "projects.chainchampions.challenge",
    "en": "Ensuring fair play and secure, automated prize distribution in a trustless gaming environment was a major hurdle.",
    "es": "Asegurar el juego limpio y la distribución de premios automatizada y segura en un entorno sin confianza (trustless) fue un obstáculo importante.",
    "fr": "Bâtir un écosystème eSport avec distribution automatique sur blockchain de manière sécurisée sans confiance (Trustless)."
  },
  {
    "path": "projects.chainchampions.solution",
    "en": "Developed robust Solidity smart contracts for escrow and tournament management, coupled with a high-performance backend to sync gaming states.",
    "es": "Desarrollo de contratos Solidity robustos para custodias de premios (escrow) y gestión de torneos, combinados con un backend de alto rendimiento para sincronizar estados de partidas.",
    "fr": "Contrats Solidity et Cloud backend robuste."
  },
  {
    "path": "projects.chainchampions.achievements[0]",
    "en": "Successful web3 integration and wallet connectivity",
    "es": "Exitosa integración web3 y conectividad de billeteras",
    "fr": "Intégration web3 accomplie"
  },
  {
    "path": "projects.chainchampions.achievements[1]",
    "en": "Implemented gas-optimised smart contracts that follow best practices",
    "es": "Implementación de contratos inteligentes optimizados para el consumo de gas según mejores prácticas",
    "fr": "Contrats optimisés gaz"
  },
  {
    "path": "projects.chainchampions.achievements[2]",
    "en": "Built an automated payout system that allowed tournaments to be played with real money and prizes in a completely secure and trustless manner",
    "es": "Construcción de un sistema automatizado de pagos que permitió jugar torneos con dinero real y premios en un ecosistema totalmente libre de intermediarios",
    "fr": "Tournois pour des prix monétaires"
  },
  {
    "path": "projects.chainchampions.achievements[3]",
    "en": "Secured platform against common smart contract exploits",
    "es": "Seguridad en la plataforma ante exploits comunes conocidos en smart contracts",
    "fr": "Plateforme immunisée aux failles"
  },
  {
    "path": "projects.nasdaq.title",
    "en": "NASDAQ Futures Trading Algorithm",
    "es": "Algoritmo de Trading de Futuros NASDAQ",
    "fr": "Algorithme Trading Futures NASDAQ"
  },
  {
    "path": "projects.nasdaq.description",
    "en": "Developed a robust trading system for NASDAQ futures for a client, implementing real-time market data processing, custom indicators and automated execution.",
    "es": "Se desarrolló un robusto sistema de trading de futuros del NASDAQ para un cliente, procesando datos en tiempo real y ejecutando indicadores técnicos complejos automáticamente.",
    "fr": "Plateforme développée pour client. Analyse et indicateurs automatisés en temps réel."
  },
  {
    "path": "projects.nasdaq.longDescription",
    "en": "Developed a robust trading system for NASDAQ futures for a client, implementing real-time market data processing, custom indicators and automated execution. The system features risk controls and hyper parameter optimisation, enabling consistent performance under various market conditions.",
    "es": "Se desarrolló un sistema robusto de trading automatizado de futuros del NASDAQ para un cliente. Implementa procesamiento en tiempo real de mercados y una ejecución automatizada. Dispone de controles de riesgo y optimización de hiperparámetros que logran consolidar el algoritmo ante las fuertes variantes y condiciones del mercado.",
    "fr": "Système complet C++ analysant données en temps réel. Inclut des contrôles de risques absolus."
  },
  {
    "path": "projects.nasdaq.challenge",
    "en": "The client had a strategy that was working for them — one they had been trading manually for years. They wanted the entire process automated.",
    "es": "El cliente tenía una estrategia manual consistente, utilizada durante años, la cual quería 100% automatizada.",
    "fr": "Automatiser la stratégie manuelle (testée depuis des années) du client de bout en bout."
  },
  {
    "path": "projects.nasdaq.solution",
    "en": "Engineered a low-latency C++ algorithm using a state machine and direct integration with the Interactive Brokers API.",
    "es": "Ingeniería de un algoritmo C++ de baja latencia mediante una máquina de estados e integración directa con la API de Interactive Brokers.",
    "fr": "Machine à états développée spécifiquement en C++ connectée à l'API Interactive Brokers."
  },
  {
    "path": "projects.nasdaq.achievements[0]",
    "en": "80% ROI in the first year",
    "es": "80% de ROI en el primer año",
    "fr": "80% de RSI première année"
  },
  {
    "path": "projects.nasdaq.achievements[1]",
    "en": "<25% drawdown",
    "es": "<25% de Drawdown máximo",
    "fr": "<25% Drawdown maximum"
  },
  {
    "path": "projects.nasdaq.achievements[2]",
    "en": "Backtested the platform hundreds of times to optimise parameters",
    "es": "Extensivo backtest del sistema para optimizar los parámetros idealmente cientos de veces",
    "fr": "Haut nombre de simulations passées (backtest)"
  },
  {
    "path": "projects.nasdaq.metrics.roi",
    "en": "Return on Investment (Year 1)",
    "es": "Retorno de la Inversión (Año 1)",
    "fr": "ROI (Année 1)"
  },
  {
    "path": "projects.nasdaq.metrics.drawdown",
    "en": "Maximum Drawdown",
    "es": "Drawdown Máximo",
    "fr": "Drawdown Maximum"
  },
  {
    "path": "projects.nasdaq.metrics.simulations",
    "en": "Simulations Run",
    "es": "Simulaciones Ejecutadas",
    "fr": "Simulations Passées"
  },
  {
    "path": "projects.lazarus.title",
    "en": "Lazarus Stock Futures Algorithm",
    "es": "Algoritmo para Futuros de Acciones Lazarus",
    "fr": "Algorithme Lazarus Market"
  },
  {
    "path": "projects.lazarus.description",
    "en": "Statistical model for Futures market after-hours activity with +90% accuracy.",
    "es": "Modelo estadístico de altísima precisión para la acción en horarios extendidos de futuros del mercado con más de +90% de exactitud.",
    "fr": "Algorithme prédictif post-marché (After Hours) d'une grande exactitude (+90%)."
  },
  {
    "path": "projects.lazarus.longDescription",
    "en": "Statistical model for Futures market after-hours activity with +90% accuracy.",
    "es": "Modelo estadístico de altísima precisión para la acción en horarios extendidos de futuros del mercado con más de +90% de exactitud.",
    "fr": "Modélisation statistique de l'activité financière des marchés d'après bourse montrant +90% de succès d'opération."
  },
  {
    "path": "projects.lazarus.challenge",
    "en": "It is well known that large after-hours activity has a strong correlation to market reactions once the market opens. The challenge was to capture these correlations and identify high-probability trade setups.",
    "es": "Se sabe bien que la vasta actividad en horas posteriores al mercado regular posee una gran correlación en el mercado al momento en que éste abre. El reto consistió en identificar estas correlaciones y aislar la creación de transacciones con altísimas probabilidades.",
    "fr": "L'activité pre/post market dicte souvent les actions le lendemain. Défi: prouver et opérer ce signalement statistiquement."
  },
  {
    "path": "projects.lazarus.solution",
    "en": "Developed a system that tracks large price drops during after-hours across the entire stock market. For each drop, it analyses historical data to determine the likelihood of various percentage price recoveries the following day, based on previous occurrences of the same scenario. Some stocks demonstrate a >80% probability of recovering at least +3% the next day, with historical backing across more than 500 occurrences — constituting a high-probability setup.",
    "es": "Se desarrolló un sistema que evalúa amplios desplomes en precios durante horarios After-Hours aplicados al mercado total de acciones, calculando mediante data del historial la probabilidad real del repunte futuro o de ciertas recuperaciones en forma de porcentajes diarios el día subsiguiente al analizarlos con más de 500 escenarios similares del pasado.",
    "fr": "Algorithme de Big Data calculant des chances de reprise (+3% au minimum) d'une action suite à de grosses disparités post-market sur l'historique."
  },
  {
    "path": "projects.lazarus.achievements[0]",
    "en": ">90% accuracy",
    "es": ">90% de precisión direccional algorítmica",
    "fr": ">90% de prédictions gagnantes algorithmiques"
  },
  {
    "path": "projects.lazarus.achievements[1]",
    "en": "~200% ROI during the summer of 2019",
    "es": "~200% ROI el verano del 2019",
    "fr": "~200% ROI en 2019"
  },
  {
    "path": "projects.lazarus.achievements[2]",
    "en": "First successful statistical modelling of financial data",
    "es": "Primer modelo de modelado estadístico financiero exitoso implementado",
    "fr": "Premier de nombreux algorithmes à succès"
  },
  {
    "path": "projects.lazarus.metrics.accuracy",
    "en": "Prediction Accuracy",
    "es": "Precisión de Predicción",
    "fr": "Précision Globale (%)"
  },
  {
    "path": "projects.lazarus.metrics.roi",
    "en": "ROI (Summer 2019)",
    "es": "ROI (Verano 2019)",
    "fr": "ROI Historique"
  },
  {
    "path": "projects.solanaMarketMaker.title",
    "en": "Solana Token Market Maker (Share Inc.)",
    "es": "Market Maker para Token de Solana (Share Inc.)",
    "fr": "Market Maker Token Solana"
  },
  {
    "path": "projects.solanaMarketMaker.description",
    "en": "Automated liquidity provision bot for Solana-based tokens using Raydium SDK.",
    "es": "Bot automatizado de provisión de liquidez para tokens basados en Solana utilizando el SDK de Raydium.",
    "fr": "Bot automatisé d'apport de liquidité sur Solana (Raydium SDK)."
  },
  {
    "path": "projects.solanaMarketMaker.longDescription",
    "en": "Built a sophisticated market-making bot that provides liquidity and price discovery for Solana tokens. Integrated directly with the Raydium SDK and implemented automated pricing strategies based on real-time market depth.",
    "es": "Se construyó un sofisticado bot creador de mercado que proporciona liquidez y descubrimiento de precios para tokens en Solana. Se integró directamente con el SDK de Raydium e implementó estrategias de precios automáticos basados en liquidez del depth.",
    "fr": "Market maker bot offrant de la liquidité algorithmique 24 heures sur 24."
  },
  {
    "path": "projects.solanaMarketMaker.challenge",
    "en": "Maintaining tight spreads and adequate liquidity on Solana during periods of extreme network congestion and high price volatility.",
    "es": "Mantener spreads ajustados y liquidez adecuada en Solana durante períodos de congestión extrema de red y alta volatilidad de precios.",
    "fr": "Spreads minces sur un réseau Solana hyper engorgé selon les minutes."
  },
  {
    "path": "projects.solanaMarketMaker.solution",
    "en": "Developed a high-frequency market-making bot using Node.js and the Raydium SDK, optimized for Solana's unique transaction processing model.",
    "es": "Desarrollador de Frecuencia Alta (HFT bot) construido en Node.js integrando recursos a la API Raydium SDK, fuertemente optimizadas las transacciones asíncronas de Solana.",
    "fr": "Application hautement optimisée en JS/Node."
  },
  {
    "path": "projects.solanaMarketMaker.achievements[0]",
    "en": "Maintained 24/7 liquidity for multiple SPL tokens",
    "es": "Mantuvo 24/7 liquidez en múltiples tokens de Solana (SPL)",
    "fr": "Tenue de marché automatique perpétuelle"
  },
  {
    "path": "projects.solanaMarketMaker.achievements[1]",
    "en": "Optimized RPC usage to minimize transaction failures",
    "es": "Optimización de redes RPC minimizando los envíos fallidos",
    "fr": "Appels RPC très restreints"
  },
  {
    "path": "projects.solanaMarketMaker.achievements[2]",
    "en": "Automated rebalancing to minimize impermanent loss",
    "es": "Gestión automatizada para minimización del Impermanent Loss",
    "fr": "Limitation de la perte temporaire (Impermanent loss)"
  },
  {
    "path": "projects.solanaMarketMaker.achievements[3]",
    "en": "Achieved consistently profitable market-making spreads",
    "es": "Consecución constante de Spreads consistentes rentables operando mercado algorítmico",
    "fr": "Rentabilité effective pour l'opérateur"
  },
  {
    "path": "projects.gotovan.title",
    "en": "GotoVan Logistics Optimizer",
    "es": "Optimizador Logístico GotoVan",
    "fr": "Gotovan Logiciel Logistique Routeur"
  },
  {
    "path": "projects.gotovan.description",
    "en": "Logistics and routing optimization platform for delivery services.",
    "es": "Plataforma de logística y optimización de rutas de los servicios de entrega.",
    "fr": "Solution complète du Travelling Salesman problématique sur flotte et fourgonnette."
  },
  {
    "path": "projects.gotovan.longDescription",
    "en": "Developed a comprehensive logistics optimizer for GotoVan, focusing on efficient route planning and resource management to streamline delivery operations.",
    "es": "Se desarrolló para GotoVan una potente aplicación general que provee organización interna eficiente a sus trabajadores y planificación en vivo enfocándose prioritariamente en una operación impecable de reparto diario logístico de mercancía y entregables variados a domicilio.",
    "fr": "Calculs de trajets performants."
  },
  {
    "path": "projects.gotovan.challenge",
    "en": "Solving the 'Traveling Salesperson' variation for a fleet of delivery vans with complex time windows and varying load capacities.",
    "es": "Resolver el desafío en la rama del \"Representante Itinerante\" de rutas lógicas operables y capacitadas, considerando cargas máximas físicas por empleado de la flota interna del negocio con exigente control cronometrable.",
    "fr": "Gérer le temps, flux et cargaisons face aux contraintes de poids, d'horaires et variables du monde réel."
  },
  {
    "path": "projects.gotovan.solution",
    "en": "Implemented a heuristic-based routing optimizer using Node.js and Google Maps API, integrated with a real-time tracking interface.",
    "es": "Aplicación Node.Js que procesa heurísticas topológicas sobre API Maps. A su lado una app integral del rastro de localización que notifica la hora final orientada de llegada precisa en base al tráfico en curso del vehículo particular del conductor asociado localizados simultáneamente.",
    "fr": "Implémentation sous Node.Js de l'API Maps complété par application mobile conducteurs."
  },
  {
    "path": "projects.gotovan.achievements[0]",
    "en": "Reduced total delivery mileage by an average of 15%",
    "es": "Redujo distancias vehiculares logísticas en media un 15%",
    "fr": "-15% de distance routière à l'optimisation"
  },
  {
    "path": "projects.gotovan.achievements[1]",
    "en": "Improved on-time delivery rate to 98%",
    "es": "Ascenso del índice del éxito logístico en puntualidad de reparto al 98%",
    "fr": "98% de performance sur livraisons ponctuelles"
  },
  {
    "path": "projects.gotovan.achievements[2]",
    "en": "Automated daily route planning for 20+ vehicles",
    "es": "Planificación algorítmica de 20 flotas motorizadas sincronizable matutina en tiempo automático",
    "fr": "Déploiement pour jusqu'à 20 véhicules automatisé"
  },
  {
    "path": "projects.gotovan.achievements[3]",
    "en": "Real-time route adjustment based on traffic data",
    "es": "Gestor Inteligente dinámico basado al tráfico por horas",
    "fr": "Mises à jour liées au traffic dynamique"
  },
  {
    "path": "projects.criptoInfra.title",
    "en": "CRIPTO Ltd Automated Trading Infrastructure",
    "es": "Infraestructura Automatizada de Trading CRIPTO Ltd",
    "fr": "Architecture Trading CRIPTO"
  },
  {
    "path": "projects.criptoInfra.description",
    "en": "Foundational infrastructure for high-frequency algorithmic trading across multiple exchanges.",
    "es": "Infraestructura fundamental base para automatización HFT multi-exchange o en múltiples bolsas criptográficas del mismo sistema algorítmico globalmente descentralizadas conectadas al sistema propietario.",
    "fr": "Monolithe structuré aux calculs financiers décentralisée multiexchanges sur Crypto."
  },
  {
    "path": "projects.criptoInfra.longDescription",
    "en": "Built the core trading infrastructure for CRIPTO Ltd, enabling automated market participation and high-speed execution across various cryptocurrency exchanges.",
    "es": "Elaboración de central algorítmica fundacional operativa integral programable Cripto Ltd asumiendo conexiones directos de ejecución bursátil o exchanges masivos operativizados.",
    "fr": "Architecture trading globale HFT de crypto actifs connectant au minimum aux flux de toutes bourses majeurs."
  },
  {
    "path": "projects.criptoInfra.challenge",
    "en": "Few consistently profitable trading algorithms exist in the cryptocurrency space. CRIPTO Ltd was founded on the premise that such a new market would be ripe for finding alpha — and as a challenge to apply data science and machine learning knowledge gained during academic studies.",
    "es": "Existen muy escasos desarrollos verdaderamente ganadores implementables sostenibles en el espacio algorítmico para altcoins (Trading algorítmico de cifrado Cripto).",
    "fr": "Les vraies réussites d'algorithmes crypto pérennes sont raréfiés. CRIPTO prouve cela applicable par les sciences de la donnée financière."
  },
  {
    "path": "projects.criptoInfra.solution",
    "en": "Developed an extensive backtesting platform over 4 years, working through every possible mistake a beginner can make before achieving a robust system. Over 1,000 strategies were developed and tested — including every possible strategy encountered from research and tutorials, not counting different parameterisations. Out of these 1,000+ strategies, 12 were consistently profitable. Investors were brought in to execute the strategies, applying SOLID OOP principles to create a scalable trading monolith. Some models achieved +90% accuracy.",
    "es": "Plataforma que somete y desarrolla exhaustivo plan riguroso que asimila y aprende errores base para consolidación fundamental construyéndose 4 años probados e incorporados. 1,000 bots creados midiendo back-test parametrizando todas integraciones facturables de trading de tutoriales formales lográndose en síntesis que tan solo doce de ellas resulten fiablidamente exitosas consistentemente bajo Principios SÓLIDOS (SOLID) y arquitectura Escalable orientadas todos en el monopolio lógico local (Trading Monolith) reportando 90%+ efectividad y aciertos.",
    "fr": "Énormément de stratégies étudiées. Création d'un Monolithe (Trade monolith). Testées rigoureusement, seules 12 ont prouvées des résultats. Modélisation via principes solides."
  },
  {
    "path": "projects.criptoInfra.achievements[0]",
    "en": "Unified connectivity to 100+ major crypto exchanges",
    "es": "Conexión a través al servidor integral +100 exchange interplataformas criptográficas globales unificadas API Rest / WeBSockets combinadamente integrados",
    "fr": "Intégration et traitement au sein d'une centaine (100+) d'exchanges API/WebSocket combinées"
  },
  {
    "path": "projects.criptoInfra.achievements[1]",
    "en": "Robust trading infrastructure for a new market",
    "es": "Robusta base estructural y lógica transaccional y financiera segura para comercio HFT (mercancías emergentes)",
    "fr": "Infrastructures logiques de hautes compétences"
  },
  {
    "path": "projects.criptoInfra.achievements[2]",
    "en": "Greatly reduced risk in a market where risk management was an afterthought",
    "es": "Descenso severamente restrictivos con algoritmos defensivos operables bajo inestabilidad de riesgo y altísima varianza del mercado real financiero del precio",
    "fr": "Sécurité de gestion des risques financiers imposés de force algorithmiquement"
  },
  {
    "path": "projects.criptoInfra.achievements[3]",
    "en": "12 consistently profitable strategies",
    "es": "Desarrolladores implementaron un filtro analítico rigurosísimo con validación integral para la obtención documentada exhaustivamente para validaciones 12 rentables reales sólidas sistemas programables finales con ROI consistente",
    "fr": "12 algorithmes opérationnels extrêmement robustes"
  },
  {
    "path": "projects.criptoInfra.metrics.strategiesBacktested",
    "en": "Strategies Developed & Backtested",
    "es": "Estrategias Probadas & Evaluadas Backtested",
    "fr": "Modélisations Financières Remplies"
  },
  {
    "path": "projects.criptoInfra.metrics.profitableStrategies",
    "en": "Consistently Profitable Strategies",
    "es": "Confiablemente Estrategias Exitosas / Rentables Creadas",
    "fr": "Gains Actifs Prouvables Financièrement Valides"
  },
  {
    "path": "projects.criptoInfra.metrics.modelAccuracy",
    "en": "Best Model Accuracy",
    "es": "Eficacia Predicción Precisa Del Optímo Sub-Agente Modelístico % (Acierto)",
    "fr": "Exactitude Majeure Sur Meilleur Réseau (%)"
  },
  {
    "path": "projects.brite.title",
    "en": "Brite Payments PSD2 API Integration",
    "es": "Brite Payments PSD2 Integración vía API",
    "fr": "Intégration Paiements Brite PSD2"
  },
  {
    "path": "projects.brite.description",
    "en": "Integration of PSD2 compliant payment APIs for real-time bank transfers.",
    "es": "Regulación PSD2 estricta de pago APIs que garantizan cobros fiablemente reales y en tiempo-real sin fronteras geográficas europeas a transacciones fiables a transferencias del ámbito general entre banca global y generalista abierta interoperativa integral local europea interconectables en API del país y la UE continentalmente regulado al banco unida o vinculada por mandato local u oficial.",
    "fr": "Inter connectivités APIs de PSD2 européen concernant des paiements interbancaires direct live."
  },
  {
    "path": "projects.brite.longDescription",
    "en": "Implemented secure and scalable integration with Brite Payments' PSD2 APIs, enabling seamless real-time account-to-account payments and bank account information services.",
    "es": "Ejecución escalablemente segura y garantizando estrictamente interconectables APIs relativas implementando soluciones transparentes transferibles en cobro y pagos real banco del mandato de la Regulación Europea en servicios y APIs fiables al banco PSD2 y normativa bancaria de datos locales de sincronía asíncrona abierta segura relativas PSD2 abierta Open Banking (Open Finance).",
    "fr": "Application et sécurisation du modèle strict OpenBanking API (PSD2 / Open Finance européenne) de paiements interbancaires live asynchrones sécuritaire."
  },
  {
    "path": "projects.brite.challenge",
    "en": "Integrating with the PSD2 framework required meeting extremely high standards for security, data privacy, and transaction reliability.",
    "es": "Cumplimiento normativo y del marco legal y financiero PSD2 extremadamente elevado en cuanto a privacidad analítica bancaria, confidencial y fiabilidad continua estricta técnica transaccional europea obligatoria in-extremis e inmutable operativa.",
    "fr": "Confidentialité de transfert, rapidité du Live transactionnel monétaire direct compte-à-compte européen en stricte exigence."
  },
  {
    "path": "projects.brite.solution",
    "en": "Engineered a secure Node.js integration layer that handled complex authentication flows and real-time bank data synchronization via REST APIs.",
    "es": "Autenticar flujo técnico o técnico estricto seguro de ingeniería unificada usando capa Node-express en servidores dedicados API/REST conectadas transfronterizas operativizadas y garantizadas y autorizaciones bancarias.",
    "fr": "Structure applicative asynchrone sécurisés répondant de manière stable (sans timeouts de serveurs)."
  },
  {
    "path": "projects.brite.achievements[0]",
    "en": "Fully compliant PSD2 API implementation",
    "es": "Aprobado íntegro en certificación PSD2/Regulaciones y Bancarias FinTech Open Finance completada",
    "fr": "Lancement OpenBanking conforme à directive (certifié)"
  },
  {
    "path": "projects.brite.achievements[1]",
    "en": "Securely processed thousands of real-time transfers",
    "es": "Gestión automatizada de pasarela a múltiples procesados reales a miles en transacciones con volumen al tiempo seguro al banco procesables integrados",
    "fr": "Maintien constant des transactions financières"
  },
  {
    "path": "projects.brite.achievements[2]",
    "en": "Implemented robust error handling for bank timeouts",
    "es": "Implementando arquitectura y control unificado anti error resolviendo tiempo límite u \"timeouts\" del banco",
    "fr": "Détours techniques mis en places sur instabilités des serveurs des différentes banques en ligne"
  },
  {
    "path": "projects.brite.achievements[3]",
    "en": "Reduced transaction friction for end-users by 30%",
    "es": "Desarrollos que mitigaron de un 30% a fricciones financieras del Front de operabilidad o compra garantizable a pasarela",
    "fr": "Fluidification forte d'UX pour usage utilisateur complet"
  },
  {
    "path": "projects.snake3d.title",
    "en": "3D Snake Minigame",
    "es": "Minijuego Snake en 3D",
    "fr": "Retro Snake 3D (Minijeu)"
  },
  {
    "path": "projects.snake3d.description",
    "en": "Classic Snake game reimagined in 3D using Three.js.",
    "es": "Juego clásico interactivo 3D completo reimaginado a base motor librerías visuales para web en Web-Three js interactivo portado.",
    "fr": "Redéfinition moderne du jeu rétro en 3D sous Web ThreeJs."
  },
  {
    "path": "projects.snake3d.longDescription",
    "en": "Originally developed in C, this project was translated to Three.js to be showcased in a web environment. It features a fully interactive 3D version of the classic snake game.",
    "es": "Generador de mapas originados local visual de forma base pura en C , portado a librerías interactivo Three.js para render Web.",
    "fr": "Port du Snake PC / C pour web et 3D sur un système à 6 faces (cubique)."
  },
  {
    "path": "projects.snake3d.challenge",
    "en": "This project was aimed at getting initial bearings with C and developing GUIs in C.",
    "es": "Portar gráficos GUI puros básicos interactuar de visualmente desarrollados iniciales visual a 3D visual orientando programabilidad o lógica desde librerías GUI formales orientados original escrito C++. ",
    "fr": "Projet de refonte (d'origine créé en basique natif pur classique C). Etude de transfert (Migration des langages aux usages réactualisés UI graphiques en 3D sur cube)."
  },
  {
    "path": "projects.snake3d.solution",
    "en": "A 3D snake game with visual transitions between faces of a cube and mappings between faces for when the snake goes around a corner.",
    "es": "Juegos visualmente cúbicos implementados visual tridimensionales con renderización y transición topología a base e integral envolventes caras uniendo geometría lógica.",
    "fr": "Passage aux outils interactifs et graphiques UI Framework js, programmations géométriques (Faces cubique 3D environnements de déplacements)."
  },
  {
    "path": "projects.snake3d.achievements[0]",
    "en": "3D environment",
    "es": "Integraciones de interactuar en espacio Render gráfico ambiente Completo en gráficos Tridimensional y Lógica Operables interactivos integrados",
    "fr": "Graphisme cubique opérant tridimensionnel (Faces cubiques interactives et visuelles fluides liées paramétrées et graphiquement intégrés 3D immersifs du Snake de jeu intégrés)"
  },
  {
    "path": "projects.snake3d.achievements[1]",
    "en": "Player controls for keyboard and touch",
    "es": "Interactivos mandos y portables accesibles y control manual en ordenador keyboard",
    "fr": "Système aux contrôles fluides clavier web (et interfaces portables pour touch control Web orientés de manière compatibles)"
  },
  {
    "path": "projects.snake3d.achievements[2]",
    "en": "Successful port from desktop-first C to web-first JS",
    "es": "Port exitosísimo implementable sin fronteras interplataformas lógicos originales del viejo escrito original lenguaje PC Desktop a Moderno Lenguaje C FrontEnd o en JS.",
    "fr": "Adaptation très propre du code aux navigateurs (Javascript ou framework)"
  },
  {
    "path": "projects.cervantes.title",
    "en": "Cervantes AI Book Writer",
    "es": "Escritor de Libros IA Cervantes",
    "fr": "Cervantes IA Littéraire"
  },
  {
    "path": "projects.cervantes.description",
    "en": "Multi-agent story writer using LLMs to generate infinite narratives.",
    "es": "IA Multiagente impulsado utilizando múltiples LLMs generando un número inimaginable de obras elaboradas en ficción historias y tramas novelas originales e infinitas.",
    "fr": "Machines et sous machines IA couplées (Ollama) opérant livres entiers qualitatifs."
  },
  {
    "path": "projects.cervantes.longDescription",
    "en": "Cervantes is a sophisticated, multi-agent AI system designed to autonomously plan, write, and refine high-quality novels. Named after the legendary author of Don Quixote, it leverages local LLMs via Ollama to bridge the gap between AI-generated text and professional-grade literary prose, employing a hierarchical multi-agent architecture (Planner, Writer, and Evaluator) to ensure narrative coherence and quality.",
    "es": "Sistema Cervantes altamente multiagente complejo e IA diseñado y perfeccionado planificablemente operativizado en escribir y generar iterativos novelas elaboradas íntegras y de gran finura y madurez. Honorando autor autor legendario del título de la novela del Quijote en memoria asimilando LLMs vía API conectores u host Ollama local usando arquitectónicamente en tres base evaluadores (Escritores Evaluatorios y Redactor Planner Evaluadores Planner IA Planner y Draft).",
    "fr": "IA Multi-agents pour rédactions et revues d’œuvres. Inspiré littérairement par Cervantès."
  },
  {
    "path": "projects.cervantes.challenge",
    "en": "Ensuring narrative consistency and literary quality over long-form writing when using smaller, local Large Language Models.",
    "es": "Logrando sostener altísima narrativa asertora con calidad estilista literariamente extensa sobre un texto en forma macro extensivo usando parámetros simples con LLMs acotados u LLMs localizados local ejecutables.",
    "fr": "Les petits LLM ont des limites de mémoire / longueur. Difficulté des IA à poursuivre l'histoire originelle sans déraillement ni pertes mémoires ni boucles (cycles IA littératures)."
  },
  {
    "path": "projects.cervantes.solution",
    "en": "Created a multi-agent workflow where different LLM instances specialise in planning, drafting, and critically evaluating the text. High quality prompts following industry best standards were required to achieve good results with smaller models.",
    "es": "Desarrollando agente múltiple o redes que iteran y planifican al nivel Macro de evaluar u escribir. Extrema dedicación en guiones base (Prompts) implementables o en base a estándares industriales del prompt design para modelado o en modelos algorítmicos restrictivos.",
    "fr": "Agent système où certains planifient, révisent et critiquent les sorties sans besoin humain intermédiaires. Mettre la pression au LLM au niveau paramétrage design complet et prompts optimisés haut qualitatif avec multiples évaluateurs systèmes agents. Architectures Planificateur et Rédacteur et Agent Reviseur d'Agent évaluatifs intégrées. Utilisation locales. Modèles Locales. Sans cloud API externe et 0$ coût d’exécutions complet externalisé."
  },
  {
    "path": "projects.cervantes.achievements[0]",
    "en": "Generated coherent narratives",
    "es": "Concreción masiva generada exitosa narrativas generativas en obras extensivas coherentes con calidad iterada algorítmica y léxica lógica extensa u orientada sin fallos ni incoherencias narrables en largo plazo o tiempo lógico",
    "fr": "Créations logiques d'ouvrées très larges d'extensions d'œuvres complexes littératures (qualité révisions excellentes analytique ou qualitatives)"
  },
  {
    "path": "projects.cervantes.achievements[1]",
    "en": "Implemented hierarchical planning agents",
    "es": "Multi Planner Red agentes organizativos programáticos evaluativos",
    "fr": "Architecture aux Agents multiples, Architectures structurel interactives inter agent"
  },
  {
    "path": "projects.cervantes.achievements[2]",
    "en": "Reduced repetitive AI patterns through iterative review",
    "es": "Mitigando un reducionismo en patrones lingüísticamente robóticos con métodos repetitivos cíclicamente mitigando iterativo revisor",
    "fr": "Éliminations des langages de machine robotisée par cycle"
  },
  {
    "path": "projects.cervantes.achievements[3]",
    "en": "Deployed fully locally for maximum privacy and cost-efficiency",
    "es": "Conseguido a uso total operativo ejecutivamente bajo servidores ejecutables u computacionales locales 100% integrales operados mitigados sobre servidores (no Cloud) mitigando costo al máximo privativo logrando cero API costo facturables u en costo total externalizable.",
    "fr": "Ressources exploitées 100% informatiquement local 0 coût total ou dépenses liés d’accès public et complètement privatifs API (Offline complètement hébergé à local) opérationnel 100% exécutifs."
  },
  {
    "path": "projects.cervantes.metrics.agents",
    "en": "Specialised Agents",
    "es": "Agentes IA Especialistas Creados Analíticamente",
    "fr": "Logiciel Agents Intégrés Multiples"
  },
  {
    "path": "projects.cervantes.metrics.apiCosts",
    "en": "API Costs",
    "es": "Recurso en Costes y Tarifación API Externas Explotables (Gasto API)",
    "fr": "Frais Variables Externe Sur Requêtes (Cloud externes API)"
  },
  {
    "path": "projects.linktrees.title",
    "en": "Linktrees Personal Link Websites",
    "es": "Sitios Web Personales tipo Linktree",
    "fr": "UI Landings Linktrees"
  },
  {
    "path": "projects.linktrees.description",
    "en": "Mobile-first linktree-style websites with diverse branding.",
    "es": "Versiones web estéticamente optimizadas linktress para usos móviles con diferentes y muy variados estilos operables web estéticos branding o UI personal de uso personal o negocio de red social en landing link o bio personales orientativas.",
    "fr": "Pages vitrine web personnelles UI pur d'intégration réseaux, hyper adaptables mobiles UX/UI et Branding personal."
  },
  {
    "path": "projects.linktrees.longDescription",
    "en": "A collection of high-performance, mobile-optimized landing pages designed for personal branding and social media links. Each version features unique aesthetic styles and optimized layouts.",
    "es": "Ecosistema de links coleccionados elaborables portafolios web u portadas para perfiles de enlace social variando diseños e incrementos de usabilidad optimizadas a UI / performance base estética.",
    "fr": "Pages performantes à landing page personnel et professionnels épuré. Axées téléphones. Sans chargement ralentis aux mobiles réseaux lents (CSS pures / framework ultra légers ou sans). Esthétiquement personnalisable branding styles au dizaines de choix de visuels couleurs. Personnels landings d'accueil et liens réseaux central."
  },
  {
    "path": "projects.linktrees.challenge",
    "en": "Creating high-performance landing pages that load instantly on any connection while maintaining a premium aesthetic across 10+ variations.",
    "es": "Obtención programática en diseño Landing visual interactivo estética UI sin descender latencia operativa en tiempos del loading o operables en velocidad web sin descender la calidad ni carga gráfica a redes celulares lentas variando en 10 plantillas implementables variadas.",
    "fr": "Garder UX excellente et une performance analytiques web parfaite malgré des variées animations branding à charges moindres. Pages optimisée au mieux aux vitesses réseaux lents téléphones, UI esthétique et sans ralentissement visuellement attractif avec UI animées légères."
  },
  {
    "path": "projects.linktrees.solution",
    "en": "Built a collection of vanilla JS/CSS templates optimized for mobile-first delivery and minimal asset weight.",
    "es": "Diseño Front UI minimalistas puros nativos en Vanill/Javascript implementando bajo peso y máxima accesibilidad visual del estilo puro.",
    "fr": "Architecture UI native sans lourdeur."
  },
  {
    "path": "projects.linktrees.achievements[0]",
    "en": "Mobile first design",
    "es": "Orientación operativa First-Mobile priorizada escalablemente optimizadas 100%",
    "fr": "Optimisations mobile parfaite"
  },
  {
    "path": "projects.linktrees.achievements[1]",
    "en": "Minimal weight",
    "es": "Peso liviano o mínimos KBs descargados analíticos UI UX y HTML/CSS UI escalables accesibilidad alta y rendimientos Lighthouse u velocidad web",
    "fr": "Impact mémoire des fichiers minimisé"
  },
  {
    "path": "projects.linktrees.achievements[2]",
    "en": "Many different branding styles",
    "es": "Diversificados Front de variadas opciones estética estiles del landing y en personal Branding del marca",
    "fr": "Haute personnalisation"
  },
  {
    "path": "projects.linktrees.metrics.templates",
    "en": "Templates",
    "es": "Plantillas Diferenciales Únicas del Landing Visualizadas",
    "fr": "Modèles d'UI Disponibles Créés"
  },
  {
    "path": "projects.neurodivergentConsulting.title",
    "en": "Neurodivergent Consulting",
    "es": "Consultoría de Neurodivergencia",
    "fr": "Neuro-Consulting Pro Accessibilité UI (Design Web)"
  },
  {
    "path": "projects.neurodivergentConsulting.description",
    "en": "Freelance coaching website tailored for neurodivergent professionals.",
    "es": "Servidor autónomas y plataforma web a un experto de Coaching diseñados específicamente al cliente autista, TDAH profesionales neurodivergente especializando estéticas e integral uso orgánico accesible y amable en uso operativo logísticas cognitivas amables (UI Accessible).",
    "fr": "Plateformes aux designs inclusives professionnels web coaching."
  },
  {
    "path": "projects.neurodivergentConsulting.longDescription",
    "en": "A premium consulting website built with a focus on accessibility and clean design. Features a modern UI using React, TailwindCSS, and Shadcn UI components.",
    "es": "Desarrollo y portales o App plataforma Front integrales Coaching profesional premium accesible implementables diseño moderno con Framework integrativos reactivos React UI y UI CSS framework React.js o tailwind integradas y accesibles de UI orientados y construibles web limpia orientables UI accesible a la vista implementables.",
    "fr": "Designs étudiés cliniquement ou basés pour atténuations UI du bruit web visuel et cognitif surchargeant utilisateurs autistes et neuro. Framework React/Shadcn UI et backend sans serveurs intégrés aux accès."
  },
  {
    "path": "projects.neurodivergentConsulting.challenge",
    "en": "Designing and implementing a UI that is highly professional yet accessible and calming for users with sensory sensitivities.",
    "es": "UI diseño y accesibilidad muy alta de estética o cognitivamente suaves amigables con el entorno amigables minimizando saturar visual UX e inhibiciones para personas TEA y personas hipersensibles en visualmente saturadas cognitivo estrés ambiental y UI de impacto bajo o amigables y accesibles cognitivo y funcionales al profesional logrando uso orgánico.",
    "fr": "Ne pas générer environnement stressants d'un site corporate conventionnalisé. UI inclusives aux sensibilités et besoins cognitifs visuels sensorielle calmes sans compromis premium UX design d'entreprise."
  },
  {
    "path": "projects.neurodivergentConsulting.solution",
    "en": "Utilised a soft colour palette and spacious layout with subtle micro-interactions to create a focused, low-friction user experience. Built with Next.JS and GCP serverless functions for easy deployment.",
    "es": "Implementación en bases paleta a escala color integral e interactivo suaves UI con espaciados y amigabilidades micro (Microinteractions UX) enfocadas baja o en la fricción de accesibilidad minimizando impacto analítico y de interactivas cognitivo logrando uso operables en accesibilidad y en experiencia. Node/Next serverles o Server function en GCloud para la distribución y servidor y Server-side render ejecutadas para optimización Web deploy. UI Accesibilidad UX UI accesible.",
    "fr": "Palettes adaptatives, très léger à micro-animations (Non intrusives ou dures UX ou flash UI) et des designs au grand blanc minimaliste (Spaced-UI et Negative-space layouts) Serverless Web GCP ou fonctions Cloud server next de la diffusion d'accueil."
  },
  {
    "path": "projects.neurodivergentConsulting.achievements[0]",
    "en": "WCAG accessibility standards",
    "es": "Aprobado de Accesibilidades de estándares organizacionales formales operables del consorcio WCAG normativas formales globales estandarizadas operativas o mundiales integradoras a accesos al UI Web Accessibility",
    "fr": "Validations WCAG des interfaces d'accès"
  },
  {
    "path": "projects.neurodivergentConsulting.achievements[1]",
    "en": "Responsive design",
    "es": "Interfaces diseño reactivo orientativos a 100% responsives Mobile First adaptativos dispositivos portables UI UX integradoras analíticos o en estéticamente operables funcionales adaptativo accesos",
    "fr": "Rendues UI 100% mobile excellents"
  },
  {
    "path": "projects.hivefrequency.title",
    "en": "HiveFrequency",
    "es": "HiveFrequency",
    "fr": "Projet Musical HiveFrequency AI Audio (Génératives Intégratifs MIDI GAN)"
  },
  {
    "path": "projects.hivefrequency.description",
    "en": "GAN+RNN architecture for real-time live music generation.",
    "es": "RNN + GAN IA para generación algorítmicamente y redes neuronales inteligencia e interpretativo integrativo de música electrónica o en generativas integrativa a directo eventos de audio interactivo musical en vivo tiempo al real e integrativas de en vivo audios generables.",
    "fr": "IA musique RNN/GAN hybride à mixage en réels interactifs audio (Latency basse performatif in Vivo AI)."
  },
  {
    "path": "projects.hivefrequency.longDescription",
    "en": "An experimental music project that combines Generative Adversarial Networks (GANs) and Recurrent Neural Networks (RNNs) to generate dynamic, evolving musical patterns in real-time.",
    "es": "Combinación IA u e interacciones operables y GAN y de forma interactiva con RNN inteligencias aplicables generados y generativas composiciones IA musicales operados orgánicos a la inteligencia.",
    "fr": "Système de génération IA combinant GAN et RNN performantes en live temps au réels sur créations d'œuvres musiques algorithmiques de sons temps réel live interactif ou performances interactives du système génératives interactif musicales audio et musiques générative MIDI ou sons (Art électronique musicales aux compositions interactives AI in Vivo live de concerts performances audio avec artistes humaines en collaboratif AI IA)."
  },
  {
    "path": "projects.hivefrequency.challenge",
    "en": "Recent advances in real-time AI music generation have pushed the boundaries of creative expression. However, many of these models are optimised for offline generation with limited interactive potential. HiveFrequency addresses this by delivering low-latency dynamic live performance integration — a unique contribution to the field: generating authentic music in real time while allowing seamless human–AI co-creation.",
    "es": "Siendo el audio tiempo real un desafío operativo al generativo AI. IA Música han llegado un alcance analítico a producciones a priori, Offline. Esta iteración solucionada u analítica resuelve audio ejecutivamente implementado a latencia mínima audios procesados o aplicados en generativos IA live musical integrativos interactivos en creaciones e inteligencias compositivo musical al vivo audios IA a creación conjunta en interacción al usuario al instante reales de forma algorítmica real analítica a IA colaborativa integral en vivo e interactivo e orgánico al oído y música e integrables dinámicamente musicales creativamente a tiempo o al ritmo.",
    "fr": "Le défi est le modèle générative musiques très lourdes de serveur nécessitent longs accès hors lignes des nuages (Offline génératives). Il fallait permettre un rendu à réactivité live du vrai performatif pour accompagner concerts génératifs musicales sans lag du systèmes temporelles rythmes musicales cohérentes à longs thermes (Longues compositions sans discordances harmonia ou asynchronités aux tempo rythme AI vs Artistes en Live Performance interaction temps au son/réels) AI génératives d'application AI musicale performatives à direct live de l'Art musicales interactions performatifs musicaux compositives audios réelles (musique interactive compositives en temps ou concerts performatives musique)."
  },
  {
    "path": "projects.hivefrequency.solution",
    "en": "Developed a novel hybrid AI model integrating GANs for high-fidelity audio segment creation and RNNs to maintain temporal coherence. The system utilises advanced compression techniques and GPU parallel processing to achieve real-time streaming with under 20ms latency. Built up from basic signal generation in Python using torchFX, the architecture evolved to feature complex multi-track generation, custom MIDI generators for basslines, and a reinforcement learning component that dynamically adjusts parameters in response to real-time user input during live performances.",
    "es": "Desarrollo Híbrido al uso a modelos de IA que integra aplicadamente implementadas o y el RNN combinando de formales estructuralmente compositivos interactivos y GANs del audio generación alta precisión resolutivamente operables en GPU comprimidos IA resolutivamente a procesar iterativos menos al instante aplicables o de 20 ms. Py/TorhFX. Multi pistas de Inteligencia o un midi y RL retroalimentativo humano integrado dinámicamente compositivos en algoritmos analíticos ejecutivos en audios del artista creativamente.",
    "fr": "Architecture complexe intégrant compression des audios générées algorithmique de GANs, structure musicale logiques compositives via un RNN, MIDI et torchFX Python. Modulatifs et interactif aux direct live générant compositives audios en directe en réactifs avec humains live performatifs musicales interactions de son ou musiques générative IA. L'audio rendu GPU a une réactivité latences infimes (-20 ms interactif audio des performances in directo live musicales de musiciens composant AI ou artiste interactives AI musicales)."
  },
  {
    "path": "projects.hivefrequency.achievements[0]",
    "en": "Achieved an ultra-low average latency of 18 milliseconds",
    "es": "Latencias analíticas 18 ms IA operables promedio operables",
    "fr": "Vitesse de traitements exceptionnels pour IA (Latency -18ms interactif IA audio)"
  },
  {
    "path": "projects.hivefrequency.achievements[1]",
    "en": "Ran continuously for 12 hours without crashes during live performance testing",
    "es": "Procesamiento vivo de 12 Hrs de ejecución a sin latencias operables a pruebas operativas ejecutivas vivo audio o crash musical analíticas pruebas o en operables reales e integradas a de la IA compositivo en audios de conciertos",
    "fr": "Tests complet de durée d'exécution (Running ininterrompues audios IA ou serveur AI de live interactifs musicales) de +12 heures ininterrompus garantissant ou assurant un accès stables live performatif d'audios musicales AI générative AI musicale de spectacle ou concert IA musical en directe sans panne (sans défaillance et ininterrompus musicales de concerts d’œuvres audio musicales génératives compositi de musiques performatifs en IA AI)"
  },
  {
    "path": "projects.hivefrequency.achievements[2]",
    "en": "Scored an average of 8.8/10 in user evaluations for authenticity and creative impact",
    "es": "Obtención y analítica de puntuaciones estandarizadas operables y cualitativos analítica de notas 8.8. (Audiencia evalúa en interacción de analíticas cualitativos humanas estéticas audio original)",
    "fr": "Auditoire de hautes satisfaction (8.8 points sur échelles humaine PEAQ audios music de qualité performatives l'AI musical original ou in Vivo des expériences des rendus music AI performative musicale de l'Intelligence)"
  },
  {
    "path": "projects.hivefrequency.achievements[3]",
    "en": "Built an interactive sequencer operating in a continuous 16-bar looping system with extensive MIDI integration",
    "es": "Integraciones MIDI o analíticas operables al loop continuo IA a secuenciadores generativos interactivo analítica compositivo operables e iterativos dinámico algorítmico o compositivo en ritmos secuenciador musical operables iteraciones analítica del audio MIDI creativamente e inteligencias generativas IA al compases integrativos operables",
    "fr": "Séquenceurs boucles infinis AI compositif de MIDI audio MIDI à interactif live ou en musique (Intégrations aux audios de séquences génératives musicales d'IA algorithmique AI compositif AI MIDI audios intégrées interactives musicales dynamiquement musicale AI)"
  },
  {
    "path": "projects.hivefrequency.metrics.avgLatency",
    "en": "Average Latency",
    "es": "Latencia al Interactivo AI (Promedio AI)",
    "fr": "Réactivité (Serveur Latency GPU moyenne interactives AI audios l'IA musicales performatives en Vivo)"
  },
  {
    "path": "projects.hivefrequency.metrics.stability",
    "en": "Continuous Stability",
    "es": "Estabilidad de Operabilidad a Horarios (Estabilidad In-Vivo Operadas del tiempo sin interrumpibles)",
    "fr": "Tests Durabilité (Running de concert performatives in Vivo ou musique ininterrompue au direct musicales stabilité continue du système)"
  },
  {
    "path": "projects.hivefrequency.metrics.audioQuality",
    "en": "PEAQ Audio Quality Score",
    "es": "Caliativo Score de Calidad o AI Audiciones Calificativas y Estéticas Operables PEAQ Escala de Audiencia a Evaluación Cualidad IA",
    "fr": "Résultat / PEAQ Évaluations (Performance qualité l'Évaluation musicale d'IA ou humaine ou des qualité audios compositives performances IA interactives AI)"
  },
  {
    "path": "projects.cruzcampo.title",
    "en": "Cruzcampo Tapeando 2025",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.cruzcampo.description",
    "en": "Emergency full-stack web application for a major Spanish beer brand.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.cruzcampo.longDescription",
    "en": "Developed in just 48 hours to save a large-scale marketing campaign. This high-pressure project involved building a robust, high-traffic web application for Cruzcampo.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.cruzcampo.challenge",
    "en": "Building, testing, and deploying a production-ready application for a national campaign in under 48 hours with expected traffic in the millions.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.cruzcampo.solution",
    "en": "Leveraged a pre-configured boilerplate and prioritized core functionality, using a scalable cloud infrastructure to handle traffic spikes.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.cruzcampo.achievements[0]",
    "en": "Delivered fully functional platform in 48 hours",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.cruzcampo.achievements[1]",
    "en": "Successfully handled 100k+ concurrent users",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.cruzcampo.achievements[2]",
    "en": "Zero downtime during the initial campaign launch",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.cruzcampo.achievements[3]",
    "en": "Saved a high-value marketing campaign from failure",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.illuvium.title",
    "en": "Illuvium Fusion Simulator",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.illuvium.description",
    "en": "Market-scanning simulator for the Illuvium Web3 NFT game.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.illuvium.longDescription",
    "en": "A strategic tool for Illuvium players that simulates NFT fusions and scans market data to identify the most profitable fusion opportunities for collectors.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.illuvium.challenge",
    "en": "Aggregating and normalizing fragmented market data from multiple Web3 marketplaces to provide real-time fusion profitability metrics.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.illuvium.solution",
    "en": "Built a high-performance market scanner using Web3.js and a React frontend for intuitive data visualization and strategy simulation.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.illuvium.achievements[0]",
    "en": "Real-time tracking of asset prices across 3+ DEXs",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.illuvium.achievements[1]",
    "en": "Simulated 1000+ fusion combinations in seconds",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.illuvium.achievements[2]",
    "en": "Provided actionable arbitrage insights for players",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.illuvium.achievements[3]",
    "en": "Mobile-responsive dashboard for on-the-go trading",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.dartboard.title",
    "en": "Dartboard Object Detection",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.dartboard.description",
    "en": "Real-time computer vision system for dartboard detection.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.dartboard.longDescription",
    "en": "A high-performance computer vision project using OpenCV and C++ to detect and track dartboards in real-time video streams with high accuracy.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.dartboard.challenge",
    "en": "Accurately detecting dartboards under varying lighting conditions and camera angles.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.dartboard.solution",
    "en": "Implemented a series of custom computer vision filters and geometric constraints using OpenCV in C++ for maximum throughput.",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.dartboard.achievements[0]",
    "en": "100% accuracy on provided dataset",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.dartboard.achievements[1]",
    "en": "Robust tracking through occlusion and motion blur",
    "es": "",
    "fr": ""
  },
  {
    "path": "projects.dartboard.achievements[2]",
    "en": "Automated scoring system integration",
    "es": "",
    "fr": ""
  },
  {
    "path": "footer.description",
    "en": "Software Engineer building high-performance systems, transforming complex ideas into elegant user-centric solutions. Driven by a deep belief and commitment to using technology as a force for good. Motivated by creating technology that solves meaningful problems and improves lives.",
    "es": "Ingeniero de Software que construye sistemas de alto rendimiento, transformando ideas complejas en soluciones elegantes centradas en el usuario. Impulsado por una profunda creencia y compromiso de usar la tecnología como una fuerza para el bien. Motivado por crear tecnología que resuelva problemas significativos y mejore vidas.",
    "fr": "Ingénieur logiciel construisant des systèmes haute performance, transformant des idées complexes en solutions élégantes axées sur l'utilisateur. Animé par une conviction profonde et un engagement à utiliser la technologie comme une force pour le bien. Motivé par la création de technologies qui résolvent des problèmes significatifs et améliorent la vie."
  },
  {
    "path": "footer.builtWith",
    "en": "Built with Next.js, Framer Motion and Passion.",
    "es": "Construido con Next.js, Framer Motion y Pasión.",
    "fr": "Construit avec Next.js, Framer Motion et Passion."
  },
  {
    "path": "opensource.title",
    "en": "Open Source Contributions",
    "es": "Contribuciones de Código Abierto",
    "fr": "Contributions Open Source"
  },
  {
    "path": "opensource.subtitle",
    "en": "A collection of public projects, experiments, and contributions to the developer community.",
    "es": "Una colección de proyectos públicos, experimentos y contribuciones a la comunidad de desarrolladores.",
    "fr": "Une collection de projets publics, d'expériences et de contributions à la communauté des développeurs."
  },
  {
    "path": "opensource.communityFirst",
    "en": "Community First",
    "es": "Comunidad Primero",
    "fr": "La Communauté d'Abord"
  },
  {
    "path": "opensource.pageSubtitle",
    "en": "I believe in giving back to the community. Here are some of my most impactful open-source projects and contributions.",
    "es": "Creo en retribuir a la comunidad. Aquí hay algunos de mis proyectos y contribuciones de código abierto más impactantes.",
    "fr": "Je crois à la contribution à la communauté. Voici quelques-uns de mes projets et contributions open source les plus impactants."
  },
  {
    "path": "opensource.ctaTitle",
    "en": "Want to collaborate?",
    "es": "¿Quieres colaborar?",
    "fr": "Vous voulez collaborer ?"
  },
  {
    "path": "opensource.ctaSubtitle",
    "en": "I'm always looking for interesting projects to contribute to. If you're working on something groundbreaking, let's talk.",
    "es": "Siempre estoy buscando proyectos interesantes a los que contribuir. Si estás trabajando en algo innovador, hablemos.",
    "fr": "Je recherche toujours des projets intéressants auxquels contribuer. Si vous travaillez sur quelque chose de révolutionnaire, parlons-en."
  },
  {
    "path": "opensource.viewGithub",
    "en": "View GitHub Profile",
    "es": "Ver Perfil de GitHub",
    "fr": "Voir le Profil GitHub"
  },
  {
    "path": "opensource.projects.binance-data-processing",
    "en": "Binance data analysis for trading bot ideas and market research.",
    "es": "Análisis de datos de Binance para ideas de bots de trading e investigación de mercado.",
    "fr": "Analyse de données Binance pour des idées de bots de trading et des recherches de marché."
  },
  {
    "path": "opensource.projects.ML-Algorithms-Analysis",
    "en": "Study of many ML algorithms using python to visually understand aspects of each algorithm.",
    "es": "Estudio de muchos algoritmos de ML con Python para entender visualmente los aspectos de cada algoritmo.",
    "fr": "Étude de nombreux algorithmes ML avec Python pour comprendre visuellement les aspects de chaque algorithme."
  },
  {
    "path": "opensource.projects.NinjaFocus",
    "en": "Solana trading bot connected to Telegram for real-time trade signals.",
    "es": "Bot de trading de Solana conectado a Telegram para señales de trading en tiempo real.",
    "fr": "Bot de trading Solana connecté à Telegram pour des signaux de trading en temps réel."
  },
  {
    "path": "opensource.projects.Cervantes-AI-Story-Writer",
    "en": "Multi-agent story writer using LLMs to generate infinite narratives.",
    "es": "Escritor de historias multi-agente que usa LLMs para generar narrativas infinitas.",
    "fr": "Écrivain d'histoires multi-agents utilisant des LLMs pour générer des récits infinis."
  },
  {
    "path": "opensource.projects.linktrees",
    "en": "Mobile-first linktree-style websites with diverse branding.",
    "es": "Sitios web estilo linktree con enfoque móvil y branding diverso.",
    "fr": "Sites web de style linktree orientés mobile avec un branding varié."
  },
  {
    "path": "opensource.projects.HiveFrequency",
    "en": "GAN+RNN architecture for real-time live music generation.",
    "es": "Arquitectura GAN+RNN para generación de música en vivo en tiempo real.",
    "fr": "Architecture GAN+RNN pour la génération de musique en direct en temps réel."
  },
  {
    "path": "opensource.projects.Dartboard-Detection",
    "en": "Dartboard detection algorithm implemented in C++ With OpenCV Computer Vision algorithms",
    "es": "Algoritmo de detección de diana implementado en C++ con algoritmos de visión por computadora OpenCV.",
    "fr": "Algorithme de détection de cible de fléchettes implémenté en C++ avec les algorithmes de vision par ordinateur OpenCV."
  },
  {
    "path": "creative.title",
    "en": "Self-Expression",
    "es": "Autoexpresión",
    "fr": "Auto-expression"
  },
  {
    "path": "creative.artTitle",
    "en": "Art Gallery",
    "es": "Galería de Arte",
    "fr": "Galerie d'Art"
  },
  {
    "path": "creative.musicTitle",
    "en": "Soundscapes",
    "es": "Paisajes Sonoros",
    "fr": "Paysages Sonores"
  },
  {
    "path": "creative.philosophyTitle",
    "en": "Philosophy",
    "es": "Filosofía",
    "fr": "Philosophie"
  },
  {
    "path": "creative.listenNow",
    "en": "Listen Now",
    "es": "Escuchar Ahora",
    "fr": "Écouter Maintenant"
  },
  {
    "path": "creative.heroTagline",
    "en": "Creativity is the Soul's Voice",
    "es": "La Creatividad es la Voz del Alma",
    "fr": "La Créativité est la Voix de l'Âme"
  },
  {
    "path": "creative.artSubtitle",
    "en": "A collection of visual experiments, digital paintings, and sketches that explore form, color, and emotion.",
    "es": "Una colección de experimentos visuales, pinturas digitales y bocetos que exploran la forma, el color y la emoción.",
    "fr": "Une collection d'expériences visuelles, de peintures numériques et de croquis qui explorent la forme, la couleur et l'émotion."
  },
  {
    "path": "creative.artNote",
    "en": "All visual art featured here is meticulously hand-drawn using traditional pencils and black pens, then digitized for display.",
    "es": "Toda la obra visual presentada aquí es dibujada a mano meticulosamente con lápices y bolígrafos tradicionales, y luego digitalizada para su presentación.",
    "fr": "Toutes les œuvres d'art présentées ici sont méticuleusement dessinées à la main avec des crayons et des stylos traditionnels, puis numérisées pour l'affichage."
  },
  {
    "path": "creative.musicSubtitle",
    "en": "Sonic journeys composed to facilitate focus, meditation, and emotional resonance.",
    "es": "Viajes sonoros compuestos para facilitar la concentración, la meditación y la resonancia emocional.",
    "fr": "Des voyages sonores composés pour faciliter la concentration, la méditation et la résonance émotionnelle."
  },
  {
    "path": "creative.worksLabel",
    "en": "Works",
    "es": "Obras",
    "fr": "Œuvres"
  },
  {
    "path": "creative.tracksLabel",
    "en": "Tracks",
    "es": "Pistas",
    "fr": "Titres"
  },
  {
    "path": "creative.philosophy",
    "en": "My art is a journey into abstract intensity, crafted with pencils, colored pencils, and black markers. I focus on vibrant, saturated colors and intricate geometric forms that challenge perception and invite deep introspection. Similarly, my music (as Shaboom) is an exploration of high-energy soundscapes and rhythmic complexity.",
    "es": "Mi arte es un viaje hacia la intensidad abstracta, creado con lápices, lápices de colores y rotuladores negros. Me centro en colores vibrantes y saturados y en formas geométricas intrincadas que desafían la percepción e invitan a una profunda introspección. Del mismo modo, mi música (como Shaboom) es una exploración de paisajes sonoros de alta energía y complejidad rítmica.",
    "fr": "Mon art est un voyage dans l'intensité abstraite, réalisé avec des crayons, des crayons de couleur et des marqueurs noirs. Je me concentre sur des couleurs vibrantes et saturées et des formes géométriques complexes qui défient la perception et invitent à une introspection profonde. De même, ma musique (sous le nom de Shaboom) est une exploration de paysages sonores à haute énergie et de complexité rythmique."
  },
  {
    "path": "creative.items.art1.title",
    "en": "Chromatic Portal",
    "es": "Portal Cromático",
    "fr": "Portail Chromatique"
  },
  {
    "path": "creative.items.art1.description",
    "en": "An intense geometric exploration of symmetry and vibrant colors, radiating from a central silhouette.",
    "es": "Una intensa exploración geométrica de la simetría y los colores vibrantes, irradiando desde una silueta central.",
    "fr": "Une exploration géométrique intense de la symétrie et des couleurs vives, rayonnant depuis une silhouette centrale."
  },
  {
    "path": "creative.items.art2.title",
    "en": "Fungal Geometry",
    "es": "Geometría Fúngica",
    "fr": "Géométrie Fongique"
  },
  {
    "path": "creative.items.art2.description",
    "en": "Organic mushroom forms set against a sharp, vibrant triangular grid.",
    "es": "Formas orgánicas de hongos sobre una cuadrícula triangular nítida y vibrante.",
    "fr": "Des formes organiques de champignons sur une grille triangulaire nette et vibrante."
  },
  {
    "path": "creative.items.art3.title",
    "en": "Monochromatic Sphere",
    "es": "Esfera Monocromática",
    "fr": "Sphère Monochromatique"
  },
  {
    "path": "creative.items.art3.description",
    "en": "A complex black and white spherical pattern evoking depth and rotational motion.",
    "es": "Un complejo patrón esférico en blanco y negro que evoca profundidad y movimiento rotacional.",
    "fr": "Un schéma sphérique complexe en noir et blanc évoquant la profondeur et le mouvement rotatif."
  },
  {
    "path": "creative.items.art4.title",
    "en": "Neural Tangles",
    "es": "Enredos Neurales",
    "fr": "Enchevêtrements Neuronaux"
  },
  {
    "path": "creative.items.art4.description",
    "en": "A colorful, chaotic web of interconnected lines representing complex networks.",
    "es": "Una telaraña colorida y caótica de líneas interconectadas que representan redes complejas.",
    "fr": "Une toile colorée et chaotique de lignes interconnectées représentant des réseaux complexes."
  },
  {
    "path": "creative.items.art5.title",
    "en": "MARC Monogram",
    "es": "Monograma MARC",
    "fr": "Monogramme MARC"
  },
  {
    "path": "creative.items.art5.description",
    "en": "A stylized, calligraphic monogram rendered in bold black ink with elegant flourishes.",
    "es": "Un monograma caligráfico estilizado trazado en tinta negra con elegantes florituras.",
    "fr": "Un monogramme calligraphique stylisé rendu à l'encre noire épaisse avec d'élégants fioritures."
  },
  {
    "path": "creative.items.art6.title",
    "en": "Triple Flow",
    "es": "Flujo Triple",
    "fr": "Triple Flux"
  },
  {
    "path": "creative.items.art6.description",
    "en": "A triskelion-inspired circular design featuring three interlocking organic shapes.",
    "es": "Un diseño circular inspirado en el triskelion con tres formas orgánicas entrelazadas.",
    "fr": "Un design circulaire inspiré du triskelion avec trois formes organiques entrelacées."
  },
  {
    "path": "creative.items.art7.title",
    "en": "Prismatic Radiance",
    "es": "Radiancia Prismática",
    "fr": "Rayonnement Prismatique"
  },
  {
    "path": "creative.items.art7.description",
    "en": "A high-intensity color study using colored pencils to create a sense of glowing energy.",
    "es": "Un estudio de color de alta intensidad con lápices de colores para crear una sensación de energía luminosa.",
    "fr": "Une étude de couleur à haute intensité aux crayons de couleur pour créer une sensation d'énergie lumineuse."
  },
  {
    "path": "creative.items.art8.title",
    "en": "Abstract Rhythm",
    "es": "Ritmo Abstracto",
    "fr": "Rythme Abstrait"
  },
  {
    "path": "creative.items.art8.description",
    "en": "A rhythmic composition of lines and shapes that reflects the energy of my music.",
    "es": "Una composición rítmica de líneas y formas que refleja la energía de mi música.",
    "fr": "Une composition rythmique de lignes et de formes qui reflète l'énergie de ma musique."
  },
  {
    "path": "creative.items.art9.title",
    "en": "Vivid Contours",
    "es": "Contornos Vívidos",
    "fr": "Contours Vifs"
  },
  {
    "path": "creative.items.art9.description",
    "en": "An exploration of form and contour using bold markers and saturated hues.",
    "es": "Una exploración de forma y contorno con rotuladores gruesos y tonos saturados.",
    "fr": "Une exploration de la forme et du contour avec des marqueurs épais et des teintes saturées."
  },
  {
    "path": "creative.items.art10.title",
    "en": "Dimensional Pyramids",
    "es": "Pirámides Dimensionales",
    "fr": "Pyramides Dimensionnelles"
  },
  {
    "path": "creative.items.art10.description",
    "en": "A minimalist pencil sketch of two interlocking pyramids, exploring depth and negative space.",
    "es": "Un boceto minimalista a lápiz de dos pirámides entrelazadas que exploran la profundidad y el espacio negativo.",
    "fr": "Un croquis minimaliste au crayon de deux pyramides entrelacées explorant la profondeur et l'espace négatif."
  },
  {
    "path": "resume.ui.hubTitle",
    "en": "Resume Hub",
    "es": "Centro de Currículum",
    "fr": "Espace CV"
  },
  {
    "path": "resume.ui.hubSubtitle",
    "en": "Select a specialized track to view a tailored resume and portfolio of relevant experience.",
    "es": "Seleccione una trayectoria especializada para ver un currículum personalizado y un catálogo de experiencia relevante.",
    "fr": "Sélectionnez une spécialisation pour voir un CV personnalisé et un aperçu de mon expérience pertinente."
  },
  {
    "path": "resume.ui.exploreTrack",
    "en": "Explore Track",
    "es": "Explorar Trayectoria",
    "fr": "Explorer la Spécialisation"
  },
  {
    "path": "resume.ui.tailoredOverview",
    "en": "Tailored overview for roles in {{role}}, including relevant tech stack and key achievements.",
    "es": "Información personalizada para roles en {{role}}, incluyendo la pila tecnológica relevante y logros clave.",
    "fr": "Aperçu personnalisé pour les rôles en {{role}}, incluant les technologies utilisées et les accomplissements clés."
  },
  {
    "path": "resume.ui.professionalExperience",
    "en": "Professional Experience",
    "es": "Experiencia Profesional",
    "fr": "Expérience Professionnelle"
  },
  {
    "path": "resume.ui.education",
    "en": "Education",
    "es": "Educación",
    "fr": "Éducation"
  },
  {
    "path": "resume.ui.skillMatrix",
    "en": "Skill Matrix",
    "es": "Matriz de Habilidades",
    "fr": "Matrice de Compétences"
  },
  {
    "path": "resume.ui.certifications",
    "en": "Certifications",
    "es": "Certificaciones",
    "fr": "Certifications"
  },
  {
    "path": "resume.ui.languages",
    "en": "Languages",
    "es": "Idiomas",
    "fr": "Langues"
  },
  {
    "path": "resume.shared.skills.languages",
    "en": "Languages",
    "es": "Idiomas",
    "fr": "Langues"
  },
  {
    "path": "resume.shared.skills.backend",
    "en": "Backend",
    "es": "Backend",
    "fr": "Backend"
  },
  {
    "path": "resume.shared.skills.infrastructure",
    "en": "Infrastructure",
    "es": "Infraestructura",
    "fr": "Infrastructure"
  },
  {
    "path": "resume.shared.skills.dataScience",
    "en": "Data Science",
    "es": "Ciencia de Datos",
    "fr": "Science des Données"
  },
  {
    "path": "resume.shared.skills.tradingSystems",
    "en": "Trading Systems",
    "es": "Sistemas de Trading",
    "fr": "Systèmes de Trading"
  },
  {
    "path": "resume.shared.skills.blockchain",
    "en": "Blockchain",
    "es": "Blockchain",
    "fr": "Blockchain"
  },
  {
    "path": "resume.shared.skills.tools",
    "en": "Tools",
    "es": "Herramientas",
    "fr": "Outils"
  },
  {
    "path": "resume.shared.skills.aiMl",
    "en": "AI/ML",
    "es": "IA/ML",
    "fr": "IA/ML"
  },
  {
    "path": "resume.shared.skills.frontend",
    "en": "Frontend",
    "es": "Frontend",
    "fr": "Frontend"
  },
  {
    "path": "resume.shared.languages.english",
    "en": "English",
    "es": "Inglés",
    "fr": "Anglais"
  },
  {
    "path": "resume.shared.languages.spanish",
    "en": "Spanish",
    "es": "Español",
    "fr": "Espagnol"
  },
  {
    "path": "resume.shared.languages.french",
    "en": "French",
    "es": "Francés",
    "fr": "Français"
  },
  {
    "path": "resume.shared.languages.native",
    "en": "Native",
    "es": "Nativo",
    "fr": "Langue maternelle"
  },
  {
    "path": "resume.shared.languages.workingProficiency",
    "en": "Working Proficiency",
    "es": "Competencia Profesional",
    "fr": "Capacité professionnelle"
  },
  {
    "path": "resume.shared.education.bristolDegree",
    "en": "BEng Computer Science & Electronics",
    "es": "BEng en Ciencias de la Computación y Electrónica",
    "fr": "BEng en Informatique et Électronique"
  },
  {
    "path": "resume.shared.education.bristolInstitution",
    "en": "University of Bristol",
    "es": "Universidad de Bristol",
    "fr": "Université de Bristol"
  },
  {
    "path": "resume.shared.education.bristolDescription",
    "en": "Maintained a First-Class average throughout the Computer Science & Electronics engineering curriculum. Transitioned from formal studies during the final year to scale a trading venture; subsequently awarded the BEng degree by the University of Bristol.",
    "es": "Mantuve un promedio de Primera Clase durante todo el currículo de ingeniería en Ciencias de la Computación y Electrónica. Hice la transición de los estudios formales durante el último año para escalar un proyecto de trading; posteriormente fui galardonado con el título de BEng por la Universidad de Bristol.",
    "fr": "Maintien d'une moyenne de première classe tout au long du cursus d'ingénieur en Informatique et Électronique. Transition des études formelles au cours de la dernière année pour développer une entreprise de trading ; diplôme BEng décerné ultérieurement par l'Université de Bristol."
  },
  {
    "path": "resume.tracks.Backend.title",
    "en": "Senior Backend Engineer",
    "es": "Ingeniero Backend Senior",
    "fr": "Ingénieur Backend Senior"
  },
  {
    "path": "resume.tracks.Backend.summary",
    "en": "Senior backend engineer with 5+ years of experience designing and scaling high-performance backend systems in FinTech and data-intensive environments. Specialized in Python, FastAPI, SQL, and cloud-native architectures.",
    "es": "Ingeniero backend senior con más de 5 años de experiencia diseñando y escalando sistemas backend de alto rendimiento en entornos FinTech y de datos intensivos. Especializado en Python, FastAPI, SQL y arquitecturas nativas de la nube.",
    "fr": "Ingénieur backend senior avec plus de 5 ans d'expérience dans la conception et la mise à l'échelle de systèmes backend haute performance dans les secteurs de la FinTech et des environnements gourmands en données. Spécialisé en Python, FastAPI, SQL et architectures cloud-natives."
  },
  {
    "path": "resume.tracks.Backend.experience.brite.role",
    "en": "Senior Backend Python Developer",
    "es": "Desarrollador Python Backend Senior",
    "fr": "Développeur Python Backend Senior"
  },
  {
    "path": "resume.tracks.Backend.experience.brite.period",
    "en": "May 2025 – July 2025",
    "es": "Mayo 2025 – Julio 2025",
    "fr": "Mai 2025 – Juillet 2025"
  },
  {
    "path": "resume.tracks.Backend.experience.brite.description[0]",
    "en": "Designed and implemented PSD2-compliant APIs using Python and FastAPI",
    "es": "Diseñé e implementé APIs compatibles con PSD2 usando Python y FastAPI",
    "fr": "Conception et mise en œuvre d'API conformes à la directive PSD2 avec Python et FastAPI"
  },
  {
    "path": "resume.tracks.Backend.experience.brite.description[1]",
    "en": "Delivered OpenAPI-standard interfaces for Open Banking integrations",
    "es": "Entregué interfaces estándar OpenAPI para integraciones de Open Banking",
    "fr": "Livraison d'interfaces standard OpenAPI pour les intégrations d'Open Banking"
  },
  {
    "path": "resume.tracks.Backend.experience.brite.description[2]",
    "en": "Collaborated in Agile Kanban environment with product and compliance teams",
    "es": "Colaboré en un entorno Agile Kanban con equipos de producto y cumplimiento",
    "fr": "Collaboration dans un environnement Agile Kanban avec les équipes produit et conformité"
  },
  {
    "path": "resume.tracks.Backend.experience.brite.description[3]",
    "en": "Improved API reliability and maintainability through structured schema validation",
    "es": "Mejoré la fiabilidad y el mantenimiento de las APIs mediante validación de esquemas estructurados",
    "fr": "Amélioration de la fiabilité et de la maintenabilité des API grâce à la validation de schémas structurés"
  },
  {
    "path": "resume.tracks.Backend.experience.technex.role",
    "en": "Director & CTO",
    "es": "Director y CTO",
    "fr": "Directeur et CTO"
  },
  {
    "path": "resume.tracks.Backend.experience.technex.period",
    "en": "Jan 2021 – Sept 2024",
    "es": "Ene 2021 – Sept 2024",
    "fr": "Janv 2021 – Sept 2024"
  },
  {
    "path": "resume.tracks.Backend.experience.technex.description[0]",
    "en": "Led backend development for multiple FinTech automation clients",
    "es": "Lideré el desarrollo backend para múltiples clientes de automatización FinTech",
    "fr": "Direction du développement backend pour plusieurs clients d'automatisation FinTech"
  },
  {
    "path": "resume.tracks.Backend.experience.technex.description[1]",
    "en": "Designed scalable Python-based services for trading, analytics, and data ingestion",
    "es": "Diseñé servicios escalables basados en Python para trading, análisis e ingesta de datos",
    "fr": "Conception de services évolutifs basés sur Python pour le trading, l'analyse et l'ingestion de données"
  },
  {
    "path": "resume.tracks.Backend.experience.technex.description[2]",
    "en": "Built real-time market data pipelines and automated portfolio systems",
    "es": "Construí pipelines de datos de mercado en tiempo real y sistemas de cartera automatizados",
    "fr": "Construction de pipelines de données de marché en temps réel et de systèmes de portefeuille automatisés"
  },
  {
    "path": "resume.tracks.Backend.experience.technex.description[3]",
    "en": "Reduced client portfolio risk by 40% using predictive volatility models",
    "es": "Reduje el riesgo de la cartera de clientes en un 40% usando modelos de volatilidad predictiva",
    "fr": "Réduction du risque de portefeuille client de 40 % grâce à des modèles de volatilité prédictive"
  },
  {
    "path": "resume.tracks.Backend.experience.technex.description[4]",
    "en": "Managed distributed engineering teams using Agile sprint methodologies",
    "es": "Gestioné equipos de ingeniería distribuidos usando metodologías Agile sprint",
    "fr": "Gestion d'équipes d'ingénierie distribuées en utilisant les méthodologies de sprint Agile"
  },
  {
    "path": "resume.tracks.Backend.experience.gotovan.role",
    "en": "Full Stack Developer",
    "es": "Desarrollador Full Stack",
    "fr": "Développeur Full Stack"
  },
  {
    "path": "resume.tracks.Backend.experience.gotovan.period",
    "en": "Mar 2022 – Nov 2023",
    "es": "Mar 2022 – Nov 2023",
    "fr": "Mars 2022 – Nov 2023"
  },
  {
    "path": "resume.tracks.Backend.experience.gotovan.description[0]",
    "en": "Developed backend services using Python FastAPI and SQL on GCP",
    "es": "Desarrollé servicios backend usando Python FastAPI y SQL en GCP",
    "fr": "Développement de services backend avec Python FastAPI et SQL sur GCP"
  },
  {
    "path": "resume.tracks.Backend.experience.gotovan.description[1]",
    "en": "Implemented route-based pricing algorithms improving logistics cost efficiency",
    "es": "Implementé algoritmos de precios basados en rutas mejorando la eficiencia de costos logísticos",
    "fr": "Mise en œuvre d'algorithmes de tarification basés sur les itinéraires, améliorant l'efficacité des coûts logistiques"
  },
  {
    "path": "resume.tracks.Backend.experience.gotovan.description[2]",
    "en": "Built internal BI tools to analyze operational data and optimize resource usage",
    "es": "Construí herramientas internas de BI para analizar datos operativos y optimizar el uso de recursos",
    "fr": "Construction d'outils de BI internes pour analyser les données opérationnelles et optimiser l'utilisation des ressources"
  },
  {
    "path": "resume.tracks.Backend.experience.gotovan.description[3]",
    "en": "Integrated OAuth authentication and Stripe payment systems",
    "es": "Integré autenticación OAuth y sistemas de pago Stripe",
    "fr": "Intégration de l'authentification OAuth et des systèmes de paiement Stripe"
  },
  {
    "path": "resume.tracks.Quant.title",
    "en": "Quantitative Developer",
    "es": "Desarrollador Cuantitativo",
    "fr": "Développeur Quantitatif"
  },
  {
    "path": "resume.tracks.Quant.summary",
    "en": "Quantitative developer with strong background in algorithmic trading, statistical modeling, and high-performance data systems. Experienced in designing automated trading strategies, risk models, and market analytics platforms.",
    "es": "Desarrollador cuantitativo con sólida formación en trading algorítmico, modelado estadístico y sistemas de datos de alto rendimiento. Experimentado en el diseño de estrategias de trading automatizadas, modelos de riesgo y plataformas de análisis de mercado.",
    "fr": "Développeur quantitatif avec une solide formation en trading algorithmique, modélisation statistique et systèmes de données haute performance. Expérimenté dans la conception de stratégies de trading automatisées, de modèles de risque et de plateformes d'analyse de marché."
  },
  {
    "path": "resume.tracks.Quant.experience.technex.role",
    "en": "Quantitative Developer",
    "es": "Desarrollador Cuantitativo",
    "fr": "Développeur Quantitatif"
  },
  {
    "path": "resume.tracks.Quant.experience.technex.period",
    "en": "Jan 2021 – Sept 2024",
    "es": "Ene 2021 – Sept 2024",
    "fr": "Janv 2021 – Sept 2024"
  },
  {
    "path": "resume.tracks.Quant.experience.technex.description[0]",
    "en": "Designed algorithmic trading systems across equities, futures, and crypto",
    "es": "Diseñé sistemas de trading algorítmico en acciones, futuros y cripto",
    "fr": "Conception de systèmes de trading algorithmique pour les actions, les contrats à terme (futures) et les cryptos"
  },
  {
    "path": "resume.tracks.Quant.experience.technex.description[1]",
    "en": "Built real-time execution engines processing market data feeds",
    "es": "Construí motores de ejecución en tiempo real procesando feeds de datos de mercado",
    "fr": "Construction de moteurs d'exécution en temps réel traitant les flux de données de marché"
  },
  {
    "path": "resume.tracks.Quant.experience.technex.description[2]",
    "en": "Reduced portfolio risk by 40% using predictive volatility models",
    "es": "Reduje el riesgo de la cartera en un 40% usando modelos de volatilidad predictiva",
    "fr": "Réduction du risque de portefeuille de 40 % grâce à des modèles de volatilité prédictive"
  },
  {
    "path": "resume.tracks.Quant.experience.technex.description[3]",
    "en": "Developed automated portfolio management and performance analytics tools",
    "es": "Desarrollé herramientas automatizadas de gestión de carteras y análisis de rendimiento",
    "fr": "Développement d'outils automatisés de gestion de portefeuille et d'analyse de performance"
  },
  {
    "path": "resume.tracks.Quant.experience.nasdaq.role",
    "en": "Quantitative Developer (Client Project)",
    "es": "Desarrollador Cuantitativo (Proyecto de Cliente)",
    "fr": "Développeur Quantitatif (Projet Client)"
  },
  {
    "path": "resume.tracks.Quant.experience.nasdaq.period",
    "en": "Jan 2023 – May 2024",
    "es": "Ene 2023 – Mayo 2024",
    "fr": "Janv 2023 – Mai 2024"
  },
  {
    "path": "resume.tracks.Quant.experience.nasdaq.description[0]",
    "en": "Developed C++ trading system integrated with Interactive Brokers",
    "es": "Desarrollé un sistema de trading en C++ integrado con Interactive Brokers",
    "fr": "Développement d'un système de trading en C++ intégré avec Interactive Brokers"
  },
  {
    "path": "resume.tracks.Quant.experience.nasdaq.description[1]",
    "en": "Implemented real-time market data processing and automated execution",
    "es": "Implementé el procesamiento de datos de mercado en tiempo real y la ejecución automatizada",
    "fr": "Mise en œuvre du traitement des données de marché en temps réel et de l'exécution automatisée"
  },
  {
    "path": "resume.tracks.Quant.experience.nasdaq.description[2]",
    "en": "Optimized strategy performance using statistical risk controls",
    "es": "Optimicé el rendimiento de la estrategia usando controles de riesgo estadísticos",
    "fr": "Optimisation des performances des stratégies grâce à des contrôles de risques statistiques"
  },
  {
    "path": "resume.tracks.Quant.experience.cripto.role",
    "en": "Co-Founder & CEO",
    "es": "Co-fundador y CEO",
    "fr": "Co-fondateur et CEO"
  },
  {
    "path": "resume.tracks.Quant.experience.cripto.period",
    "en": "Sept 2019 – Dec 2020",
    "es": "Sept 2019 – Dic 2020",
    "fr": "Sept 2019 – Déc 2020"
  },
  {
    "path": "resume.tracks.Quant.experience.cripto.description[0]",
    "en": "Built quantitative trading infrastructure executing hundreds of strategies",
    "es": "Construí infraestructura de trading cuantitativo ejecutando cientos de estrategias",
    "fr": "Construction d'une infrastructure de trading quantitatif exécutant des centaines de stratégies"
  },
  {
    "path": "resume.tracks.Quant.experience.cripto.description[1]",
    "en": "Applied Bayesian inference and Gaussian Processes to market prediction",
    "es": "Apliqué inferencia bayesiana y Procesos Gaussianos a la predicción de mercados",
    "fr": "Application de l'inférence bayésienne et des processus gaussiens à la prédiction des marchés"
  },
  {
    "path": "resume.tracks.Quant.experience.cripto.description[2]",
    "en": "Achieved 44% annual return across automated investment systems",
    "es": "Logré un retorno anual del 44% en sistemas de inversión automatizados",
    "fr": "Obtention d'un rendement annuel de 44 % sur les systèmes d'investissement automatisés"
  },
  {
    "path": "resume.tracks.Quant.experience.cripto.description[3]",
    "en": "Led research, strategy design, and system architecture",
    "es": "Lideré la investigación, el diseño de estrategias y la arquitectura del sistema",
    "fr": "Direction de la recherche, de la conception des stratégies et de l'architecture système"
  },
  {
    "path": "resume.tracks.Web3.title",
    "en": "Web3 Engineer",
    "es": "Ingeniero Web3",
    "fr": "Ingénieur Web3"
  },
  {
    "path": "resume.tracks.Web3.summary",
    "en": "Web3 engineer with deep experience building blockchain-based trading systems, NFT platforms, and smart contract infrastructure. Specialized in Solidity, Solana, and TypeScript-based blockchain integrations.",
    "es": "Ingeniero Web3 con profunda experiencia en la construcción de sistemas de trading basados en blockchain, plataformas NFT e infraestructura de contratos inteligentes. Especializado en Solidity, Solana e integraciones de blockchain basadas en TypeScript.",
    "fr": "Ingénieur Web3 avec une vaste expérience dans la construction de systèmes de trading basés sur la blockchain, de plateformes NFT et d'infrastructures de contrats intelligents. Spécialisé en Solidity, Solana et intégrations blockchain basées sur TypeScript."
  },
  {
    "path": "resume.tracks.Web3.experience.chainchampions.role",
    "en": "Full Stack Web3 Developer",
    "es": "Desarrollador Web3 Full Stack",
    "fr": "Développeur Web3 Full Stack"
  },
  {
    "path": "resume.tracks.Web3.experience.chainchampions.period",
    "en": "May 2024 – Present",
    "es": "Mayo 2024 – Presente",
    "fr": "Mai 2024 – Présent"
  },
  {
    "path": "resume.tracks.Web3.experience.chainchampions.description[0]",
    "en": "Developed NFT tournament platform using React, Node.js, TypeScript",
    "es": "Desarrollé plataforma de torneos NFT usando React, Node.js, TypeScript",
    "fr": "Développement d'une plateforme de tournois NFT avec React, Node.js, TypeScript"
  },
  {
    "path": "resume.tracks.Web3.experience.chainchampions.description[1]",
    "en": "Implemented Solidity smart contracts for escrow, buy-ins, and payouts",
    "es": "Implementé contratos inteligentes en Solidity para depósito, compras y pagos",
    "fr": "Mise en œuvre de contrats intelligents Solidity pour l'entiercement (escrow), les mises et les paiements"
  },
  {
    "path": "resume.tracks.Web3.experience.chainchampions.description[2]",
    "en": "Deployed cloud infrastructure on GCP with secure contract interactions",
    "es": "Desplegué infraestructura en la nube en GCP con interacciones seguras de contratos",
    "fr": "Déploiement d'une infrastructure cloud sur GCP avec des interactions de contrats sécurisées"
  },
  {
    "path": "resume.tracks.Web3.experience.chainchampions.description[3]",
    "en": "Ensured parameterized rule systems for automated tournament execution",
    "es": "Aseguré sistemas de reglas parametrizadas para la ejecución automatizada de torneos",
    "fr": "Mise en place de systèmes de règles paramétrés pour l'exécution automatisée des tournois"
  },
  {
    "path": "resume.tracks.Web3.experience.technex.role",
    "en": "Web3 Engineer / Director & CTO",
    "es": "Ingeniero Web3 / Director y CTO",
    "fr": "Ingénieur Web3 / Directeur et CTO"
  },
  {
    "path": "resume.tracks.Web3.experience.technex.period",
    "en": "Jan 2021 – Sept 2024",
    "es": "Ene 2021 – Sept 2024",
    "fr": "Janv 2021 – Sept 2024"
  },
  {
    "path": "resume.tracks.Web3.experience.technex.description[0]",
    "en": "Designed and deployed smart contracts for DeFi and NFT platforms",
    "es": "Diseñé y desplegué contratos inteligentes para plataformas DeFi y NFT",
    "fr": "Conception et déploiement de contrats intelligents pour les plateformes DeFi et NFT"
  },
  {
    "path": "resume.tracks.Web3.experience.technex.description[1]",
    "en": "Built automated crypto trading and market-making systems",
    "es": "Construí sistemas automatizados de trading de criptomonedas y market-making",
    "fr": "Construction de systèmes automatisés de trading de cryptos et de tenue de marché (market-making)"
  },
  {
    "path": "resume.tracks.Web3.experience.technex.description[2]",
    "en": "Integrated blockchain services with off-chain APIs and SQL databases",
    "es": "Integré servicios de blockchain con APIs off-chain y bases de datos SQL",
    "fr": "Intégration de services blockchain avec des API hors chaîne et des bases de données SQL"
  },
  {
    "path": "resume.tracks.Web3.experience.technex.description[3]",
    "en": "Led security-focused development using audited open-source standards",
    "es": "Lideré el desarrollo centrado en la seguridad usando estándares de código abierto auditados",
    "fr": "Direction d'un développement axé sur la sécurité utilisant des normes open-source auditées"
  },
  {
    "path": "resume.tracks.Web3.experience.share.role",
    "en": "Solana Token Market Maker",
    "es": "Creador de Mercado de Tokens Solana",
    "fr": "Teneur de Marché de Jetons Solana"
  },
  {
    "path": "resume.tracks.Web3.experience.share.period",
    "en": "Sept 2020 – Dec 2021",
    "es": "Sept 2020 – Dic 2021",
    "fr": "Sept 2020 – Déc 2021"
  },
  {
    "path": "resume.tracks.Web3.experience.share.description[0]",
    "en": "Built market-making bot providing liquidity to Solana-based token",
    "es": "Construí un bot de market-making proporcionando liquidez a un token basado en Solana",
    "fr": "Construction d'un bot de tenue de marché fournication de liquidité à un jeton basé sur Solana"
  },
  {
    "path": "resume.tracks.Web3.experience.share.description[1]",
    "en": "Integrated with Solana blockchain using Node.js and Raydium SDK",
    "es": "Integré con la blockchain de Solana usando Node.js y el SDK de Raydium",
    "fr": "Intégration avec la blockchain Solana en utilisant Node.js et le SDK Raydium"
  },
  {
    "path": "resume.tracks.Web3.experience.share.description[2]",
    "en": "Designed automated pricing and liquidity strategies backed by SQL data",
    "es": "Diseñé estrategias automatizadas de precios y liquidez respaldadas por datos SQL",
    "fr": "Conception de stratégies automatisées de tarification et de liquidité basées sur les données SQL"
  },
  {
    "path": "resume.tracks.AI.title",
    "en": "AI & ML Engineer",
    "es": "Ingeniero de IA y ML",
    "fr": "Ingénieur IA et ML"
  },
  {
    "path": "resume.tracks.AI.summary",
    "en": "Specialist in building AI agents and machine learning models for predictive analytics and automation. Experienced in applying Bayesian inference and neural networks to complex data-driven problems.",
    "es": "Especialista en la construcción de agentes de IA y modelos de aprendizaje automático para análisis predictivo y automatización. Experimentado en la aplicación de inferencia bayesiana y redes neuronales a problemas complejos impulsados por datos.",
    "fr": "Spécialiste dans la construction d'agents d'IA et de modèles de machine learning pour l'analyse prédictive et l'automatisation. Expérimenté dans l'application de l'inférence bayésienne et des réseaux neuronaux à des problèmes complexes axés sur les données."
  },
  {
    "path": "resume.tracks.AI.experience.technex.role",
    "en": "Director & CTO (AI Focus)",
    "es": "Director y CTO (Enfoque en IA)",
    "fr": "Directeur et CTO (Focus IA)"
  },
  {
    "path": "resume.tracks.AI.experience.technex.period",
    "en": "Jan 2021 – Sept 2024",
    "es": "Ene 2021 – Sept 2024",
    "fr": "Janv 2021 – Sept 2024"
  },
  {
    "path": "resume.tracks.AI.experience.technex.description[0]",
    "en": "Developed predictive volatility models using Gaussian Processes",
    "es": "Desarrollé modelos de volatilidad predictiva usando Procesos Gaussianos",
    "fr": "Développement de modèles de volatilité prédictive à l'aide de processus gaussiens"
  },
  {
    "path": "resume.tracks.AI.experience.technex.description[1]",
    "en": "Built automated risk management systems driven by ML analytics",
    "es": "Construí sistemas automatizados de gestión de riesgos impulsados por analítica de ML",
    "fr": "Construction de systèmes automatisés de gestion des risques pilotés par l'analyse ML"
  },
  {
    "path": "resume.tracks.AI.experience.technex.description[2]",
    "en": "Integrated AI-driven insights into FinTech automation tools",
    "es": "Integré perspectivas impulsadas por IA en herramientas de automatización FinTech",
    "fr": "Intégration d'aperçus pilotés par l'IA dans les outils d'automatisation FinTech"
  },
  {
    "path": "resume.tracks.AI.experience.cripto.role",
    "en": "Co-Founder (ML Researcher)",
    "es": "Co-fundador (Investigador de ML)",
    "fr": "Co-fondateur (Chercheur ML)"
  },
  {
    "path": "resume.tracks.AI.experience.cripto.period",
    "en": "Sept 2019 – Dec 2020",
    "es": "Sept 2019 – Dic 2020",
    "fr": "Sept 2019 – Déc 2020"
  },
  {
    "path": "resume.tracks.AI.experience.cripto.description[0]",
    "en": "Applied Bayesian inference to market prediction and strategy optimization",
    "es": "Apliqué inferencia bayesiana a la predicción de mercados y optimización de estrategias",
    "fr": "Application de l'inférence bayésienne à la prédiction des marchés et à l'optimisation des stratégies"
  },
  {
    "path": "resume.tracks.AI.experience.cripto.description[1]",
    "en": "Researched and implemented high-performance Gaussian Process models",
    "es": "Investigué e implementé modelos de Procesos Gaussianos de alto rendimiento",
    "fr": "Recherche et mise en œuvre de modèles de processus gaussiens haute performance"
  },
  {
    "path": "resume.tracks.Web.title",
    "en": "Fullstack Developer",
    "es": "Desarrollador Fullstack",
    "fr": "Développeur Fullstack"
  },
  {
    "path": "resume.tracks.Web.summary",
    "en": "Fullstack developer focused on building high-performance web applications with modern tech stacks. Specialized in React, Node.js, and FastAPI integrations.",
    "es": "Desarrollador fullstack centrado en la construcción de aplicaciones web de alto rendimiento con pilas tecnológicas modernas. Especializado en integraciones de React, Node.js y FastAPI.",
    "fr": "Développeur fullstack axé sur la construction d'applications web haute performance avec des technologies modernes. Spécialisé dans les intégrations React, Node.js et FastAPI."
  },
  {
    "path": "resume.tracks.Web.experience.chainchampions.role",
    "en": "Full Stack Web3 Developer",
    "es": "Desarrollador Web3 Full Stack",
    "fr": "Développeur Web3 Full Stack"
  },
  {
    "path": "resume.tracks.Web.experience.chainchampions.period",
    "en": "May 2024 – Present",
    "es": "Mayo 2024 – Presente",
    "fr": "Mai 2024 – Présent"
  },
  {
    "path": "resume.tracks.Web.experience.chainchampions.description[0]",
    "en": "Developed NFT tournament platform using React, Node.js, TypeScript",
    "es": "Desarrollé plataforma de torneos NFT usando React, Node.js, TypeScript",
    "fr": "Développement d'une plateforme de tournois NFT avec React, Node.js, TypeScript"
  },
  {
    "path": "resume.tracks.Web.experience.chainchampions.description[1]",
    "en": "Built interactive frontends with complex state management for gaming",
    "es": "Construí frontends interactivos con gestión de estado compleja para juegos",
    "fr": "Construction de frontends interactifs avec une gestion d'état complexe pour les jeux"
  },
  {
    "path": "resume.tracks.Web.experience.gotovan.role",
    "en": "Full Stack Developer",
    "es": "Desarrollador Full Stack",
    "fr": "Développeur Full Stack"
  },
  {
    "path": "resume.tracks.Web.experience.gotovan.period",
    "en": "Mar 2022 – Nov 2023",
    "es": "Mar 2022 – Nov 2023",
    "fr": "Mars 2022 – Nov 2023"
  },
  {
    "path": "resume.tracks.Web.experience.gotovan.description[0]",
    "en": "Developed backend services using Python FastAPI and SQL on GCP",
    "es": "Desarrollé servicios backend usando Python FastAPI y SQL en GCP",
    "fr": "Développement de services backend avec Python FastAPI et SQL sur GCP"
  },
  {
    "path": "resume.tracks.Web.experience.gotovan.description[1]",
    "en": "Built internal BI tools with data visualization for operational optimization",
    "es": "Construí herramientas internas de BI con visualización de datos para la optimización operativa",
    "fr": "Construction d'outils de BI internes avec visualisation de données pour l'optimisation opérationnelle"
  },
  {
    "path": "resume.tracks.Web.experience.gotovan.description[2]",
    "en": "Integrated OAuth authentication and Stripe payment systems",
    "es": "Integré autenticación OAuth y sistemas de pago Stripe",
    "fr": "Intégration de l'authentification OAuth et des systèmes de paiement Stripe"
  },
  {
    "path": "seo.title",
    "en": "MarcYourMind | Multi-Domain Software Engineer",
    "es": "MarcYourMind | Ingeniero de Software Multi-Dominio",
    "fr": "MarcYourMind | Ingénieur Logiciel Multi-Domaine"
  },
  {
    "path": "seo.description",
    "en": "Personal portfolio of MarcYourMind, a Senior Software Engineer building high-performance systems across Quant, AI, Web3, and Backend architecture.",
    "es": "Portafolio personal de MarcYourMind, un Ingeniero de Software Senior especializado en construir sistemas de alto rendimiento en Cuantitativas, IA, Web3 y arquitectura Backend.",
    "fr": "Portefeuille personnel de MarcYourMind, un Ingénieur Logiciel Senior construisant des systèmes haute performance dans les domaines Quant, IA, Web3 et architecture Backend."
  }
]