{
	"reliableLogistics": "Logística en la que puedes confiar",
	"familyBusiness": "Negocio familiar establecido en el Reino Unido especializado en el transporte de paquetes, mercancías y mudanzas a Francia, España, Portugal, Islas Baleares e Islas Canarias.",
	"whatDoYouNeed": "¿Qué necesitas?",
	"safeReliableServices": "Ofrecemos servicios seguros y confiables",
	"courierServices": "Servicios de mensajería",
	"efficientNationalCourier": "Servicios de mensajería nacionales eficientes",
	"reliableTimelyDelivery": "Entrega fiable y oportuna",
	"hassleFreeNationalShipping": "Envío nacional sin complicaciones",
	"customsCostsHandled": "Costos de aduana gestionados para usted",
	"importsExports": "Importaciones / Exportaciones",
	"gotoVanServices": "GotoVan ofrece servicios de importación y exportación fiables y eficientes adaptados para satisfacer sus necesidades específicas. Ya sea que traiga mercancías al Reino Unido o las lleve a España, nuestro equipo experimentado está aquí para gestionar la logística y ofrecer una experiencia de transporte sin problemas.",
	"movingWithinUK": "¿Te mudas dentro del Reino Unido? Ya sea que te estés mudando dentro de la misma ciudad o de una ciudad a otra, nuestro equipo dedicado está aquí para ayudarte en cada paso del camino.",
	"movingOutsideUK": "¿Te mudas fuera del Reino Unido? GotoVan ofrece servicios de mudanza nacionales convenientes y confiables para que tu mudanza sea libre de estrés. Ya sea que te mudes a España, Portugal, Francia, Islas Baleares o Islas Canarias, nuestro equipo dedicado está aquí para ayudarte en cada paso del camino.",
	"clientsSpeak": "Nuestros clientes hablan",
	"whyUs": "¿Por qué nosotros?",
	"anyQuestionsContactUs": "¿Alguna pregunta? Contáctenos",
	"trustworthy": "¡De confianza!",
	"smoothMovingExperience": "Sin dolores de cabeza, sin sobrecostes posteriores, sin líos de aduanas. Hicieron de mi mudanza algo muy sencillo, tanto para mí como para mi familia. ¡Repetiré! - Carlos Dianez",
	"thankYouGotoVan": "Gracias, GotoVan.",
	"excellentCompany": "Excelente empresa. Mi familia y yo llevamos ya casi un año utilizando sus servicios, los cuales son excelentes con atención personal a la vez que profesional. Los paquetes y su contenido siempre llegan en excelentes condiciones. - Susana Mel",
	"simpleProcedures": "Trámites simples.",
	"stressFreeExperience": "Sin todo el estrés y sorpresas con aduanas que generan otras empresas. Incluso me llegó antes de lo esperado. Empresa extremadamente recomendable. - Juan Antonio Portela",
	"highlyRecommended": "Recomendables 100%",
	"customerReview": "Rápidos, amigables, eficaces y sin complicaciones. Recomendables al 100%. Si necesito otro envío, no dudaré en contactar con ellos. - María Teresa Lara",
	"fillContactForm": "Complete el formulario para contactarnos",
	"contactHours": "Horario de contacto",
	"redirectToBlog": "Redireccionando a nuestro blog",
	"confirmExitWebsite": "Está a punto de salir de este sitio web, por favor, confirme",
	"thankYouForPurchase": "¡Gracias por su compra!",
	"paymentSuccessful": "El pago se realizó con éxito",
	"continueExploring": "Continúa explorando",
	"pageNotFoundMessage": "Lo siento, no pudimos encontrar la página que buscabas.",
	"confirm": "confirmar",
	"about": {
		"everythingBeginsWithJourney": "Todo comienza con un viaje",
		"welcomeToGotoVan": "Bienvenido a GotoVan, su empresa líder en servicios de mensajería con una rica historia de cuatro años en la industria del transporte. Nos enorgullece entregar paquetes de manera segura y eficiente y proporcionar servicios de mudanza confiables en todo el Reino Unido, España, Portugal, Francia, Islas Baleares e Islas Canarias.",
		"experiencedDriverTeam": "Nossa equipe experiente e profissional de motoristas está dedicada a garantir que seus pacotes e pertences cheguem ao destino no prazo e em perfeitas condições. Seja um pacote pequeno ou um serviço completo de remoção, a GotoVan é a sua escolha.",
		"priorityOfEfficiency": "Entendemos la importancia del tiempo, por eso priorizamos un servicio rápido y eficiente. Utilizando la última tecnología para el seguimiento y monitoreo, le mantenemos informado y seguro de que su paquete está en buenas manos.",
		"commitmentToCustomerService": "Nuestro compromiso con un servicio al cliente excepcional y nuestro amplio conocimiento de la industria del transporte ha convertido a GotoVan en la opción preferida tanto para particulares como para empresas. Únase a nosotros para experimentar la diferencia que un servicio de calidad puede marcar.",
		"dedicatedTeamTransport": "Cada semana, nuestro equipo dedicado trabaja incansablemente para transportar paquetes y mudanzas entre el Reino Unido, Francia y España. Desde las recolecciones en todo el Reino Unido los jueves y viernes hasta un viaje cuidadosamente planificado a través de Francia para llegar a España el lunes, garantizamos una experiencia fluida y sin complicaciones.",
		"dedicatedToDeliveringItems": "No importa el tamaño de su envío, GotoVan se dedica a entregar los artículos de manera segura y a tiempo, conectando empresas y particulares de manera fluida a través de las fronteras. Confíe en nosotros para obtener servicios de mensajería confiables y eficientes, donde sea que su paquete deba llegar."
	},
	"features": {
		"qualityService": "Servicio de calidad",
		"familyOwnedBusiness": "Negocio familiar",
		"flexibility": "Flexibilidad",
		"liveTracking": "Seguimiento en vivo",
		"serviceDescription": "Proporcionamos un servicio <statsText>de máxima calidad</statsText> con recogida y entrega directamente en su puerta.",
		"businessPride": "Nos enorgullecemos de dirigir este negocio como una <statsText>familia</statsText>, entregando nuestros servicios con éxito.",
		"humanTouch": "Somos humanos, y eso significa que <statsText>estamos aquí</statsText> para mantenernos en contacto contigo en cada paso del camino.",
		"stayInformed": "<statsText>Manténgase informado</statsText> en cada paso del camino.",
		"comingSoon": "PRÓXIMAMENTE"
	},
	"experienceYears": "Más de <span>{{years}}</span> años de experiencia",
	"": ""
}