{
	"reliableLogistics": "Logistics you can rely on",
	"familyBusiness": "Family business established in the UK specialized in transport of parcels, goods and removals to France, Spain, Portugal, Balearic Islands and Canary Islands.",
	"whatDoYouNeed": "What do you need?",
	"safeReliableServices": "We provide safe and reliable services",
	"courierServices": "Courier Services",
	"efficientNationalCourier": "Efficient national courier services",
	"reliableTimelyDelivery": "Reliable and timely delivery",
	"hassleFreeNationalShipping": "Hassle-free national shipping",
	"customsCostsHandled": "Customs costs handled for you",
	"importsExports": "Imports / Exports",
	"gotoVanServices": "GotoVan offers reliable and efficient import and export services tailored to meet your specific needs. Whether you're bringing goods to the UK or taking them to Spain, our experienced team is here to handle the logistics for a seamless transportation experience.",
	"movingWithinUK": "Moving within the United Kingdom? Whether you're relocating within the same city or moving from one city to another, our dedicated team is here to assist you every step of the way.",
	"movingOutsideUK": "Moving outside the United Kingdom? GotoVan offers convenient and reliable national removal services to make your move stress-free. Whether you're relocating to Spain, Portugal, France, Balearic or Canary Islands, our dedicated team is here to assist you every step of the way.",
	"clientsSpeak": "Our Clients Speak",
	"whyUs": "Why Us?",
	"anyQuestionsContactUs": "Any questions? Contact us",
	"trustworthy": "Trustworthy!",
	"smoothMovingExperience": "No headaches, no hidden costs, no customs hassles. They made my move very simple, both for me and my family. I will repeat! - Carlos Dianez",
	"thankYouGotoVan": "Thank you, GotoVan.",
	"excellentCompany": "Excellent company. My family and I have been using their services for almost a year now, which are excellent with personal and professional attention. The packages and their content always arrive in excellent condition. - Susana Mel",
	"simpleProcedures": "Simple procedures.",
	"stressFreeExperience": "Without all the stress and surprises with customs that other companies generate. It even arrived earlier than expected. Extremely recommended company. - Juan Antonio Portela",
	"highlyRecommended": "Highly recommended 100%",
	"customerReview": "Fast, friendly, efficient, and hassle-free. 100% recommended. If I need another shipment, I won't hesitate to contact them. - María Teresa Lara",
	"fillContactForm": "Fill up the form to contact us",
	"contactHours": "Contact hours",
	"redirectToBlog": "Redirecting to our Blog",
	"confirmExitWebsite": "You are about to exit this website, please confirm",
	"thankYouForPurchase": "Thank you for your purchase!",
	"paymentSuccessful": "Payment was successful",
	"continueExploring": "Continue exploring",
	"pageNotFoundMessage": "Sorry, we couldn't find the page you were looking for.",
	"confirm": "confirm",
	"about": {
		"everythingBeginsWithJourney": "Everything begins with a journey",
		"welcomeToGotoVan": "Welcome to GotoVan, your leading courier services company with a rich history of four years in the transportation industry. We take pride in safely and efficiently delivering packages and providing reliable removal services across the United Kingdom, Spain, Portugal, France, Balearic Islands, and Canary Islands.",
		"experiencedDriverTeam": "Our experienced and professional driver team is dedicated to ensuring your packages and belongings reach their destination on time and in perfect condition. Whether it's a small package or a full removal service, GotoVan is your go-to choice.",
		"priorityOfEfficiency": "We understand the importance of time, which is why we prioritize quick and efficient service. Utilizing the latest technology for tracking and monitoring, we keep you informed and confident that your package is in safe hands.",
		"commitmentToCustomerService": "Our commitment to exceptional customer service and extensive knowledge of the transportation industry has made GotoVan the preferred choice for individuals and businesses alike. Join us in experiencing the difference that quality service can make.",
		"dedicatedTeamTransport": "Every week, our dedicated team works tirelessly to transport packages and removals between the United Kingdom, France, and Spain. From collections across the UK on Thursdays and Fridays to a carefully planned journey through France to reach Spain on Monday, we ensure a smooth and hassle-free experience.",
		"dedicatedToDeliveringItems": "No matter the size of your shipment, GotoVan is dedicated to delivering items safely and on time, connecting businesses and individuals seamlessly across borders. Trust us for reliable and efficient courier services, wherever your package needs to go."
	},
	"features": {
		"qualityService": "Quality Service",
		"familyOwnedBusiness": "Family-Owned Business",
		"flexibility": "Flexibility",
		"liveTracking": "Live Tracking",
		"serviceDescription": "We provide a <statsText>top-quality</statsText> service with pickup and delivery right to your doorstep.",
		"businessPride": "We take pride in running this business as a <statsText>family</statsText>, successfully delivering our services.",
		"humanTouch": "We're human, and that means <statsText>we're here</statsText> to stay in touch with you every step of the way.",
		"stayInformed": "<statsText>Stay informed</statsText> every step of the way.",
		"comingSoon": "COMING SOON"
	},
	"experienceYears": "More than <span>{{years}}</span> of experience",
	"": ""
}